&НаКлиенте
Процедура ТоварыСуммаНДСПриИзменении(Элемент)
	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	Если СтрокаРасчета.Сумма <> Неопределено
			И СтрокаРасчета.СуммаНДС <> Неопределено Тогда
		СтрокаРасчета.Всего = СтрокаРасчета.Сумма + СтрокаРасчета.СуммаНДС;
	КонецЕсли;	
КонецПроцедуры
 
&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	СтавкаЧисло = ПолучитьСтавку(СтрокаРасчета.СтавкаНДС);
	СтрокаРасчета.СуммаНДС = СтрокаРасчета.Сумма * СтавкаЧисло;
	ТоварыСуммаНДСПриИзменении(Элемент);
КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ПолучитьСтавку(СтавкаНДС)
	Возврат СтавкаНДС.Ставка / 100;
КонецФункции
 
&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ТоварыСтавкаНДСПриИзменении(Элемент);
КонецПроцедуры
 
&НаКлиенте
Процедура ТоварыКоличествоЦенаПриИзменении(Элемент)
	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	Если СтрокаРасчета.Цена <> Неопределено 
			И СтрокаРасчета.Количество <> Неопределено Тогда
		СтрокаРасчета.Сумма = СтрокаРасчета.Цена * СтрокаРасчета.Количество;
	КонецЕсли;
	ТоварыСуммаПриИзменении(Элемент);
КонецПроцедуры
 
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	СтрокаРасчета.СтавкаНДС = ПолучитьСтавкуТовара(СтрокаРасчета.Номенклатура);
	ТоварыСтавкаНДСПриИзменении(Элемент);
КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ПолучитьСтавкуТовара(Товар)
    Возврат Товар.НДС;
КонецФункции
