//Перем ирПортативный Экспорт;
//Перем ирОбщий Экспорт;
//Перем ирСервер Экспорт;
//Перем ирКэш Экспорт;
//Перем ирПривилегированный Экспорт;

Перем ирПлатформа Экспорт;

Перем мКэшТиповВнешнихМетаданных Экспорт;
Перем мНеПодключеныОбработки Экспорт;
Перем мВнешниеМодули Экспорт;
Перем мКаталогОбработки Экспорт;
Перем мКартинки;
Перем мПолучениеФорм;
Перем мИмяСервера;
Перем VBScript;
Перем мВерсия Экспорт;
Перем мКэшФункций;
Перем мСерверныйМодульДоступен;
Перем мСерверныйМодульЗаписиДоступен;
Перем мСерверныйМодульСсылка;
Перем мМодульЗаписиВнешнегоСоединения;
Перем мДополнительныеОтчетыИОбработки;

//#Область ГлобальныеПортативныеМетоды

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОЖИДАНИЯ

#Если Клиент Тогда
		
Процедура ОсвободитьВсеИндикаторыПроцессовОтложенноЛкс() Экспорт
	
	ирОбщий.ОсвободитьВсеИндикаторыПроцессовЛкс();
	
КонецПроцедуры

Процедура СохранитьНастройкиПользователяОтложенноЛкс() Экспорт
	
	СохранитьНастройкиПользователя();
	
КонецПроцедуры

Процедура ВыполнитьПроверкуСовместимостиКонфигурацииЛкс() Экспорт 
	
	//мПлатформа = ирКэш.Получить();
	//#Если Сервер И Не Сервер Тогда
	//    мПлатформа = Обработки.ирПлатформа.Создать();
	//#КонецЕсли
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		Если ирОбщий.ВосстановитьЗначениеЛкс("ПроверятьПодпискиКонфигурации", Истина) <> Ложь Тогда 
			// Проверка компиляции общих модулей с обработчиками событий
			СписокМодулей = Новый Структура;
			СписокМодулейВызоваСервера = Новый Структура;
			ОбщиеМодули = Метаданные.ОбщиеМодули;
			#Если ТолстыйКлиентУправляемоеПриложение Тогда
				ИмяКлиента = "Управляемое";
			#Иначе
				ИмяКлиента = "Обычное";
			#КонецЕсли 
			ИмяСвойства = "Клиент" + ИмяКлиента + "Приложение";
			Для Каждого Подписка Из Метаданные.ПодпискиНаСобытия Цикл
				#Если Сервер И Не Сервер Тогда
					Подписка = Метаданные.ПодпискиНаСобытия.ВерсионированиеОбъектов_ПриЗаписиОбъекта;
				#КонецЕсли
				МетаМодуль = ОбщиеМодули.Найти(ирОбщий.ПолучитьПервыйФрагментЛкс(Подписка.Обработчик));
				Если МетаМодуль = Неопределено Тогда
					// Некорректная подписка
					Продолжить;
				КонецЕсли; 
				Если Не ирКэш.ЛиПортативныйРежимЛкс() Тогда 
					// Проверяем только подписки менеджеров
					Если Не МетаМодуль[ИмяСвойства] И Не МетаМодуль.ВызовСервера Тогда 
						ТипыИсточников = Подписка.Источник.Типы(); // Долго!
						Если Не (ТипыИсточников.Количество() = 0 Или ирОбщий.ЛиТипОбъектаБДЛкс(ТипыИсточников[0])) Тогда
							СписокМодулей.Вставить(МетаМодуль.Имя);
						КонецЕсли; 
					КонецЕсли;
				Иначе
					// Проверяем все подписки в портативном режиме обычном приложении
					Если Не МетаМодуль[ИмяСвойства] Тогда 
						СписокМодулей.Вставить(МетаМодуль.Имя);
					КонецЕсли;
				КонецЕсли;
				Если Подписка.Событие = "ОбработкаПолученияПредставления" И МетаМодуль.ВызовСервера Тогда
					СписокМодулейВызоваСервера.Вставить(МетаМодуль.Имя);
				КонецЕсли;
			КонецЦикла;
			Если СписокМодулей.Количество() > 0 Тогда
				Если ирКэш.ЛиПортативныйРежимЛкс() Тогда 
					ТипыОбъектовПодписок = "";
				Иначе
					ТипыОбъектовПодписок = " менеджеров";
				КонецЕсли; 
				Сообщить("В конфигурации обнаружены недоступные на клиенте (" + ИмяКлиента + " приложение) общие модули с обработчиками подписок на события" + ТипыОбъектовПодписок + ".", СтатусСообщения.Внимание);
				Сообщить("Поэтому в работе некоторых инструментов возможны ошибки ""При подписке * на событие * произошла ошибка. Обработчик события не найден.""");
				Если ИмяКлиента = "Обычное" Тогда
					Сообщить("Необходимо в конфигураторе установить ""Сервис""/""Параметры""/""Редактирование конфигурации для режимов запуска""=""Управляемое приложение и обычное приложение"".");
				КонецЕсли; 
				Если Не ирКэш.ЛиПортативныйРежимЛкс() Тогда 
					ТекстСообщения = "Рекомендуется установить флажок ""Клиент (" + ИмяКлиента + " приложение)"" или ""Вызова сервера"" и обеспечить компиляцию у этих общих модулей:";
				Иначе
					ТекстСообщения = "Рекомендуется установить флажок ""Клиент (" + ИмяКлиента + " приложение)"" и обеспечить компиляцию у этих общих модулей:";
				КонецЕсли;
				Для Каждого КлючИЗначение Из СписокМодулей Цикл
					ТекстСообщения = ТекстСообщения + " " + КлючИЗначение.Ключ + ",";
				КонецЦикла;
				Сообщить(ТекстСообщения);
			КонецЕсли;
			Если СписокМодулейВызоваСервера.Количество() > 0 Тогда
				Сообщить("В конфигурации обнаружены недоступные на клиенте (" + ИмяКлиента + " приложение) общие модули с обработчиками подписок на событие ""ОбработкаПолученияПредставления"".", СтатусСообщения.Внимание);
				Сообщить("Это может приводить к сильному замеделению получения представлений таких ссылок. Поэтому перенесите эти обработчики в модуль, компилируемый на толстых клиентах");
				Для Каждого КлючИЗначение Из СписокМодулей Цикл
					ТекстСообщения = ТекстСообщения + " " + КлючИЗначение.Ключ + ",";
				КонецЦикла;
				Сообщить(ТекстСообщения);
			КонецЕсли;
		КонецЕсли; 
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Если Истина
				И Метаданные.ОсновнойРежимЗапуска = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение
				И Не Метаданные.ИспользоватьУправляемыеФормыВОбычномПриложении 
			Тогда
				Сообщить("Рекомендуется включить в свойствах конфигурации флажок ""Использовать управляемые формы в обычном приложении""");
			КонецЕсли; 
		#КонецЕсли 
	#КонецЕсли
	#Если ТолстыйКлиентУправляемоеПриложение Тогда
		ирОбщий.ПроверитьФлажокИспользоватьОбычныеФормыВУправляемомПриложенииЛкс();
	#КонецЕсли
	//Если Метаданные.ВариантВстроенногоЯзыка = Метаданные.СвойстваОбъектов.ВариантВстроенногоЯзыка.Английский Тогда
	//	Сообщить("Подсистема не полностью поддерживает вариант встроенного языка Английский.", СтатусСообщения.Внимание);
	//КонецЕсли;

КонецПроцедуры

#КонецЕсли 

////////////////////////////////////////////////////////////////////////////////
// ОТЛАДКА

// Обертка ирОбщий.ПрЛкс(). Присваивает первому параметру второй.
// Удобно вызывать из отладчика через диалог "Вычислить выражение". 
//
// Параметры:
//  П1           – Произвольный – параметр1;
//  П2           – Произвольный – параметр2;
//
// Возвращаемое значение:
//  П2 – Не используется.
//
Функция Пр(п1, п2 = Неопределено) Экспорт
	
	Результат = ирОбщий.ПрЛкс(п1, п2);
	Возврат Результат;
	
КонецФункции // Присвоить()

// Обертка ирОбщий.ДуЛкс(). Выполняет программный код, переданный как параметр.
// Остальные Параметры могут участвовать в теле этого кода.
// Удобно использовать в отладчике.
//
// Параметры:
//  П1           – Произвольный – параметр1;
//  П2           – Произвольный – параметр2;
//  П3           – Произвольный – параметр3;
//  П4           – Произвольный – параметр4;
//
// Возвращаемое значение:
//  Неопределено – Не используется.
//
Функция Ду(Знач ТекстПрограммы, п1 = 0, п2 = 0, п3 = 0, п4 = 0)  Экспорт
	
	Результат = ирОбщий.ДуЛкс(ТекстПрограммы, п1, п2, п3, п4);
	Возврат Результат;
	
КонецФункции // Ду()

// Обертка ирОбщий.ОперироватьЛкс(). На клиенте открывает консоль кода с передачей туда всех своих параметров. На сервере сразу выполняет код.
// Изменения параметров возвращаются в вызывающий контекст в модальном режиме.
//
// Параметры:
//  ТекстПрограммы    - Строка - программный код для передачи в консоль кода или выполнения;
//  РежимОперации     – Число - 0 - немодально, 1 - модально, 2 - неинтерактивно (на сервере всегда);
//  СтрокаИменПараметров – Строка - имена параметров для консоли кода через запятую, если не указаны, то будут оригинальные П*;
//  П*             – Произвольный - параметры для использования при выполнении программного кода;
//
// Возвращаемое значение:
//  Строка - описание ошибок.
//
Функция Оперировать(Знач ТекстПрограммы = "", Знач РежимОперации = 0, СтрокаИменПараметров= "",
	П1 = Null, П2 = Null, П3 = Null, П4 = Null, П5 = Null, П6 = Null, П7 = Null, П8 = Null, П9 = Null) Экспорт

	Результат = ирОбщий.ОперироватьЛкс(ТекстПрограммы, РежимОперации, СтрокаИменПараметров, П1, П2, П3, П4, П5, П6, П7, П8, П9);
	Возврат Результат;

КонецФункции // РП()

// Обертка ирОбщий.ПерЛкс(). Подготавливает строку для помещения всех переменных в структуру с целью ее дальнейшего вычисления в отладчике "Вычислить(Пер())".
// Изменения параметров возвращаются в вызывающий контекст.
//
// Параметры:
//  ТекстПрограммы    - Строка, *"" - программный код для анализа, берется из буфера обмена если пустой.
//
// Возвращаемое значение:
//  Строка для вычисления в отладчике.
//
Функция Пер(Знач ТекстПрограммы =  "") Экспорт
	
	Результат = ирОбщий.ПерЛкс(ТекстПрограммы);
	Возврат Результат;
	
КонецФункции

// Обертка ирОбщий.ПолВТЛкс(). Функция получает структуру (Имя временной таблицы; Таблица значений) из указанного запроса или менеджера временных таблиц.
// Полезна для просмотра временных таблиц из менеджера временных таблиц серверного контекста в отладчике.
// Параметры:
//   ЗапросИлиМенеджерВременныхТаблиц - Запрос, МенеджерВременныхТаблиц
//   ИменаВременныхТаблиц - Строка, *"" - имена существующих, но возможно не используемых в тексте запроса временных таблиц через запятую
//   ДопустимоеЧислоСтрок - Число, *500000 - выбирать из временной таблицы не более этого числа строк
//
// Результат - ТаблицаЗначений, Структура
//
Функция ПолВТ(ЗапросИлиМенеджерВременныхТаблиц, ИменаВременныхТаблиц = "", ДопустимоеЧислоСтрок = 500000) Экспорт
	
	Результат = ирОбщий.ПолВТЛкс(ЗапросИлиМенеджерВременныхТаблиц, ИменаВременныхТаблиц, ДопустимоеЧислоСтрок);
	Возврат Результат;
	
КонецФункции // ПолВТ()

// Обертка ирОбщий.ТехНЛкс(). Начать трассу в технологическом журнале. Сам технологический журнал надо заранее включить.
Функция ТехН() Экспорт
	
	Результат = ирОбщий.ТехНЛкс();
	Возврат Результат;
	
КонецФункции

// Обертка ирОбщий.ТехКЛкс(). Кончить трассу в технологическом журнале и показать ее анализ
Функция ТехК() Экспорт
	
	Результат = ирОбщий.ТехКЛкс();
	Возврат Результат;
	
КонецФункции

#Если Клиент Тогда

// Обертка ирОбщий.ПопЛкс(). Подготавливает строку для вызова Оперировать() в отладчике. Вызвается путем вычисления "Вычислить(Поп())".
// Изменения параметров возвращаются в вызывающий контекст.
//
// Параметры:
//  ТекстПрограммы    - Строка, *"" - программный код для передачи в консоль кода или выполнения, берется из буфера обмена если пустой;
//  РежимОперации     – Число - 0 - немодально, 1 - модально, 2 - неинтерактивно (на сервере всегда);
//
// Возвращаемое значение:
//  Строка для вычисления в отладчике.
//
Функция Поп(Знач ТекстПрограммы =  "", РежимОперации = 1) Экспорт
	
	Результат = ирОбщий.ПопЛкс(ТекстПрограммы, РежимОперации);
	Возврат Результат;
	
КонецФункции

// Обертка ирОбщий.ОпЛкс(). Модально открывает консоль кода с передачей туда всех своих параметров.
// Удобно вызывать из отладчика через диалог "Вычислить выражение". 
// Изменения параметров возвращаются в вызывающий контекст.
//
// Параметры:
//  П*  – Произвольный;
//
// Возвращаемое значение:
//  Неопределено.
//
Функция Оп(П1 = Null, П2 = Null, П3 = Null, П4 = Null, П5 = Null) Экспорт

	Результат = ирОбщий.ОпЛкс(П1, П2, П3, П4, П5);
	Возврат Результат;

КонецФункции // Оп()

// Обертка ирОбщий.ОперироватьСтруктуройЛкс(). Открывает консоль кода с передачей туда структуры параметров.
// Изменения параметров возвращаются в структуру, но не в вызывающий контекст.
//
// Параметры:
//  ТекстПрограммы - Строка;
//  Модально     – Булево - открывать окно модально;
//  СтруктураПараметров – Структура - ключи соответсвуют именам параметов, а значения их значениям.
//
// Возвращаемое значение:
//  Неопределено.
//
Функция ОперироватьСтруктурой(Знач ТекстПрограммы = "", Модально = Ложь, СтруктураПараметров) Экспорт

	Результат = ирОбщий.ОперироватьСтруктуройЛкс(ТекстПрограммы, Модально, СтруктураПараметров);
	Возврат Результат;

КонецФункции // РП()

// Обертка ирОбщий.ОпсЛкс(). Обертка ОперироватьСтруктурой. Модально открывает консоль кода с передачей туда всех своих параметров.
// Удобно вызывать из отладчика через диалог "Вычислить выражение". 
// Изменения параметров возвращаются в структуру, но не в вызывающий контекст.
//
// Параметры:
//  СтруктураПараметров – Структура - ключи соответсвуют именам параметов, а значения их значениям.
//
// Возвращаемое значение:
//  Неопределено.
//
Функция Опс(Знач СтруктураПараметров) Экспорт

	Результат = ирОбщий.ОпсЛкс(СтруктураПараметров);
	Возврат Результат;

КонецФункции // Опс()

// Обертка ирОбщий.НаблюдатьЛкс(). Выводит в окно сообщений переданное значение вместе с типом и заданным представлением.
//
// Параметры:
//  Значение     - Произвольный;
//  *Представление – Строка, *"" - представление наблюдаемого значения.
//
Процедура Наблюдать(Знач Значение, Представление = "") Экспорт

	ирОбщий.НаблюдатьЛкс(Значение, Представление);

КонецПроцедуры // Наблюдать()

#КонецЕсли 

// Обертка ирОбщий.ОтладитьЛкс(). Открывает нужную консоль для редактирования сложного объекта. 
// Варианты использования в зависимости от типа параметра Объект:
//   Запрос, COMОбъект - открывает Запрос или ADODB.Command или ADODB.Connection в консоли запросов
//   ПостроительЗапроса - открывает результирующий запрос построителя запросов в консоли запросов
//   ПостроительОтчета - открывает построитель отчета в консоли построителей отчетов, откуда можно открыть результирующий запрос построителя отчета в консоли запросов
//   СхемаКомпоновки - открывает схему компоновки в консоли компоновки данных, откуда можно открыть результирующие (из макета компоновки) запросы в консоли запросов
//
// Параметры:
//  Объект       – Запрос, ПостроительЗапроса, ПостроительОтчета, СхемаКомпоновкиДанных, COMОбъект.ADODB.Command - исследуемый объект;
//  Модально     – Булево - открывать окно модально, должно быть Истина для использования функции в отладчике;
//  НастройкаКомпоновкиИлиТекстЗапроса - НастройкиКомпоновкиДанных, Строка, *Неопределено - настройки для схемы компоновки, текст запроса для WMI или ADODB.Connection;
//  ВнешниеНаборыДанных - Структура, *Неопределено - внешние наборы данных для схемы компоновки;
//  ОтложеннаяОтладка - Булево - на сервере игнорируется (равно Истина), вместо открытия инструмента отладки сразу выполняется помещение
//                      объектов отладки во временное хранилище;
//  ДопустимоеЧислоСтрокВоВременнойТаблицеОтложеннойОтладки - Число, *500000 - допустимое количество строк во всех временных таблицах запроса
//                      для отложенной отладки, больше этого количества строки не сохраняются, о чем сообщается в результате;
//  Наименование - Строка - наименование сохраняемого объекта отложенной отладки;
//
// Возвращаемое значение:
//  Неопределено.
//
Функция Отладить(Знач Объект, Модально = Ложь, Знач НастройкаКомпоновкиИлиТекстЗапроса = Неопределено, Знач ВнешниеНаборыДанных = Неопределено,
	ОтложенноеВыполнение = Ложь, ДопустимоеЧислоСтрокВоВременнойТаблицеОтложеннойОтладки = 500000, Наименование = "") Экспорт 
	
	Результат = ирОбщий.ОтладитьЛкс(Объект, Модально, НастройкаКомпоновкиИлиТекстЗапроса, ВнешниеНаборыДанных, ОтложенноеВыполнение, ДопустимоеЧислоСтрокВоВременнойТаблицеОтложеннойОтладки,, Наименование);
	Возврат Результат;
	
КонецФункции 

// Обертка ирОбщий.ОтЛкс(). Модально (на клиенте) или отложенно (на сервере) открывает нужную консоль для редактирования/отладки объекта.
// Удобно вызывать из отладчика через диалог "Вычислить выражение". 
// Варианты использования в зависимости от типа параметра Объект:
//   Запрос, COMОбъект, HttpСоединение - открывает Запрос или ADODB.Command или ADODB.Connection в консоли запросов
//   ПостроительЗапроса - открывает результирующий запрос построителя запросов в консоли запросов
//   ПостроительОтчета - открывает построитель отчета в консоли построителей отчетов, откуда можно открыть результирующий запрос построителя отчета в консоли запросов
//   СхемаКомпоновки - открывает схему компоновки в консоли компоновки данных, откуда можно открыть результирующие (из макета компоновки) запросы в консоли запросов
//   МакетКомпоновкиДанных - открытвает запросы макета компоновки в консоли запросов
//   ОтчетОбъект - открывает схему и настройки компоновки отчета в консоли компоновки данных, откуда можно открыть результирующие (из макета компоновки) запросы в консоли запросов
//
// Параметры:
//  Объект       – Запрос, ПостроительЗапроса, ПостроительОтчета, СхемаКомпоновкиДанных, МакетКомпоновкиДанных, ОтчетОбъект, ADODB.Command, ADODB.Connection, HttpСоединение - исследуемый объект;
//  НастройкаКомпоновкиИлиТекстЗапросаИлиИменаВременныхТаблиц - НастройкиКомпоновкиДанных, Строка, *Неопределено - 
//                      если первый параметр СхемаКомпоновкиДанных, то настройки компоновки,
//                      если первый параметр WMI или ADODB.Connection, то текст запроса,
//                      если первый параметр HttpСоединение, то HttpЗапрос,
//                      если первый параметр Запрос, имена временных таблиц разделенных запятыми;
//  ВнешниеНаборыДанных - Структура, *Неопределено - внешние наборы данных для схемы компоновки;
//  ОтложеннаяОтладка - Булево - на сервере игнорируется (равно Истина), вместо открытия инструмента отладки сразу выполняется помещение
//                      объектов отладки во временное хранилище;
//  Наименование - Строка - наименование сохраняемого объекта отложенной отладки;
//
// Возвращаемое значение:
//  Неопределено.
//
Функция От(Знач Объект, Знач НастройкаКомпоновкиИлиТекстЗапросаИлиИменаВременныхТаблиц = Неопределено, Знач ВнешниеНаборыДанных = Неопределено, ОтложеннаяОтладка = Ложь, Наименование = "") Экспорт 

	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если ирКэш.ЛиПортативныйРежимЛкс() Тогда
			Пустышка = ПолучитьФорму(Неопределено); // Чтобы использовалась форма именно этого объекта
		КонецЕсли; 
	#КонецЕсли 
	Результат = ирОбщий.ОтЛкс(Объект, НастройкаКомпоновкиИлиТекстЗапросаИлиИменаВременныхТаблиц, ВнешниеНаборыДанных, ОтложеннаяОтладка, Наименование);
	Если ирКэш.ЛиПортативныйРежимЛкс() Тогда
		ирПортативный.УсловныйДеструктор();
	КонецЕсли; 
	Возврат Результат;

КонецФункции

// Обертка ирОбщий.ИсследоватьЛкс(). Открывает исследователь объектов.
//
// Параметры:
//  Объект       – Произвольный, *Неопределено - объект, который будет исследован;
//  Модально     – Булево - открывать окно модально;
//  КакКоллекцию – Булево, *Ложь - исследовать как коллекцию вместо объекта.
//
// Возвращаемое значение:
//  Сам объект.
//
Функция Исследовать(Знач Объект = Неопределено, Модально = Ложь, КакКоллекцию = Ложь, ОтложенноеВыполнение = Ложь) Экспорт

	Результат = ирОбщий.ИсследоватьЛкс(Объект, Модально, КакКоллекцию, ОтложенноеВыполнение);
	Возврат Результат;
	
КонецФункции // Исследовать()

// Обертка ирОбщий.ИсЛкс(). Модально открывает объект в исследователе объектов
// Удобно вызывать из отладчика через диалог "Вычислить выражение". 
Функция Ис(Знач Объект = Неопределено, КакКоллекцию = Ложь, ОтложенноеВыполнение = Ложь) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если ирКэш.ЛиПортативныйРежимЛкс() Тогда
			Пустышка = ПолучитьФорму(Неопределено); // Чтобы использовалась форма именно этого объекта
		КонецЕсли; 
	#КонецЕсли 
	Результат = ирОбщий.ИсЛкс(Объект, КакКоллекцию, ОтложенноеВыполнение);
	Если ирКэш.ЛиПортативныйРежимЛкс() Тогда
		ирПортативный.УсловныйДеструктор();
	КонецЕсли; 
	Возврат Результат;

КонецФункции // Ис()

// Обертка ирОбщий.ФайлЛкс() Возвращает текст из файла
Функция Файл(Знач ИмяФайла) Экспорт 
	
	Результат = ирОбщий.ФайлЛкс(ИмяФайла);
	Возврат Результат;
	
КонецФункции

// обертка ирОбщий.СкорКолЛкс() Удаляет все элементы коллекции кроме заданного или первого.
Функция СокрКол(Коллекция, ОставитьЭлементИлиКлюч = Неопределено) Экспорт 
	
	ирОбщий.СокрКолЛкс(Коллекция, ОставитьЭлементИлиКлюч);
	
КонецФункции

//#КонецОбласти

////#Область ОбработчикиИнициализацииФорм

Процедура ИнициализироватьФорму_Обработка_ирАнализЖурналаРегистрации_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирЖурнал");
	ЭтаФорма.ЭлементыФормы.ТаблицаЖурнала.Колонки.Уровень.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирУровниЖурналаРегистрации");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОткрытьФайлЖурнала.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОткрыть");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.АнализТехножурнала.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТехноЖурнал");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЖурналРегистрации.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЖурналРегистрации.Кнопки.ОткрытьМенеджерТабличногоПоля.Картинка = ирКэш.КартинкаПоИмениЛкс("ирМенеджерТабличногоПоля");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЖурналРегистрации.Кнопки.ОтборБезЗначенияВТекущейКолонке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЖурналРегистрации.Кнопки.РазличныеЗначенияКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокСПометками");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЖурналРегистрации.Кнопки.КонсольКомпоновки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЖурналРегистрации.Кнопки.НастроитьРегистрациюСобытия.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНастройкаЖурналаРегистрации");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОтбор.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОтбор.Кнопки.ОтборБезЗначения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОтбор.Кнопки.ОтборПоЗначению.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборПоЗначению");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОтбор.Кнопки.СохранитьВариантОтбора.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСохранитьВариантНастроек");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОтбор.Кнопки.ЗагрузитьВариантОтбора.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗагрузитьВариантНастроек");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСписка.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирАнализЖурналаРегистрации_Форма_ФормаСобытия(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирАнализЖурналаРегистрации_Форма_РедакторСписка(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОткрытьМенеджерТабличногоПоля.Картинка = ирКэш.КартинкаПоИмениЛкс("ирМенеджерТабличногоПоля");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОтборБезЗначенияВТекущейКолонке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.РазличныеЗначенияКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокСПометками");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирАнализТехножурнала_Форма_БлокировкаСУБД(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирБлокировка");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.СравнитьТексты.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирАнализТехножурнала_Форма_Блокировка1С(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирБлокировка");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирАнализТехножурнала_Форма_КонверторТекстаСУБД(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.КонсольЗапросов.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольЗапросов");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.НастроитьТехножурналПоТексту.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНастройкаТехножурнала");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.КонтекстноеМенюТаблиц.Кнопки.ПоказатьСтруктуруХранения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИндексы");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирАнализТехножурнала_Форма_НастройкаЧтения(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирАнализТехножурнала_Форма_ПланЗапросаMSSQL(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирАнализТехножурнала_Форма_Событие(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирАнализТехножурнала_Форма_СхемаБД(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирАнализТехножурнала_Форма_Трассы(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.Трассы.Колонки.НаСервере.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирВыполнитьНаСервере");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирАнализТехножурнала_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирТехноЖурнал");
	ЭтаФорма.ЭлементыФормы.ТаблицаЖурнала.Колонки.Картинка.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирУровниЖурналаРегистрации");
	ЭтаФорма.ЭлементыФормы.ТаблицаЖурнала.Колонки.НаСервере.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирВыполнитьНаСервере");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Трасса.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗамер");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.НастройкаЖурнала.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНастройкаТехножурнала");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ЖурналРегистрации.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЖурнал");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЖурналРегистрации.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЖурналРегистрации.Кнопки.ПоказатьВнутренниеСобытия.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВложенныйЗапрос");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЖурналРегистрации.Кнопки.СжатьКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСжатьКолонку");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЖурналРегистрации.Кнопки.ОтборБезЗначенияВТекущейКолонке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЖурналРегистрации.Кнопки.РазличныеЗначенияКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокСПометками");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЖурналРегистрации.Кнопки.НастройкаСобытия.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНастройкаТехножурнала");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЖурналРегистрации.Кнопки.КонсольКомпоновки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЖурналРегистрации.Кнопки.ПоказыватьПанельИтогов.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСвертка");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЖурналРегистрации.Кнопки.ПоказыватьПанельСвойств.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСвертка");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирВыгрузкаЗагрузкаДанныхЧерезФайл_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирВыгрузкаЗагрузка");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.РедакторИзмененийНаУзле.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИзмененияНаУзле");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРезультатЗагрузки.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРезультатЗагрузки.Кнопки.РазличныеЗначенияКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокСПометками");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРезультатЗагрузки.Кнопки.ОтборБезЗначенияВТекущейКолонке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРезультатЗагрузки.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирДинамическийСписок_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирСписокЗначений");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.ОтборБезЗначенияВТекущейКолонке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.КопироватьКлючСтроки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.ПоследниеВыбранные.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПоследниеВыбранные");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.НайтиВыбратьПоID.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИдентификатор");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.ДобавитьСтрокуЧерезРедакторОбъектаБД1.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.ИзменитьСтрокуЧерезРедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.СвязанныйРедакторОбъектаБДСтроки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.РедакторОбъектаБДЯчейки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.ОбработатьОбъекты.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.РазличныеЗначенияКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокСПометками");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.Идентификаторы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПусто");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.СколькоСтрок.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСумма");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.ОткрытьОбъектМетаданных.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИнтерфейснаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.СправкаМетаданного.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСправкаМетаданного");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.КП_Список.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПереключателяДерева.Кнопки.РежимДерева.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоЗначений");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирДинамическийСписок_Форма_НастройкиКолонок(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.МенеджерТабличногоПоля.Картинка = ирКэш.КартинкаПоИмениЛкс("ирМенеджерТабличногоПоля");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОтборБезЗначенияВТекущейКолонке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирЗагрузкаТабличныхДанных_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирЗагрузка");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличногоДокумента.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличногоДокумента.Кнопки.ОткрытьВОтдельномОкне.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТабличныйДокумент");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличногоДокумента.Кнопки.Автоширина.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКолонкаТабличногоПоля");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСопоставлениеКолонокТЗ.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСопоставлениеКолонокТЗ.Кнопки.РедакторОбъектаБДЯчейки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.СопоставлениеКолонокТЗ.Колонки.ОписаниеТипов.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаЗначений.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаЗначений.Кнопки.ОткрытьТаблицу.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТаблицаЗначений");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаЗначений.Кнопки.Идентификаторы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПусто");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаЗначений.Кнопки.РазличныеЗначенияКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокСПометками");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаЗначений.Кнопки.РедакторОбъектаБДЯчейки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаЗначений.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаБД.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаБД.Кнопки.РазличныеЗначенияКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокСПометками");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаБД.Кнопки.РедакторОбъектаБДЯчейки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаБД.Кнопки.РедакторОбъектаБДСтроки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаБД.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КП_СопоставлениеКолонокТаблицыБД.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_СопоставлениеКолонокТаблицыБД.Кнопки.РедакторОбъектаБДЯчейки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.СопоставлениеКолонокБД.Колонки.ОписаниеТиповПриемника.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.СопоставлениеКолонокБД.Колонки.ОписаниеТиповИсточника.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КолонкиТЗ.Колонки.ОписаниеТипов.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирЗагрузкаТабличныхДанных_Форма_ФормаВыбораЗначения(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирЗагрузкаТабличныхДанных_Форма_ФормаВыбораНастройки(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирЗагрузкаТабличныхДанных_Форма_ФормаСохраненияНастройки(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирИнтерфейснаяПанель_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирИнтерфейснаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДереваИнтерфейса.Кнопки.ВставитьИзБуфера.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДереваИнтерфейса.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДеревоИнтерфейса.Колонки.КоличествоСтрок.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирСумма");
	ЭтаФорма.ЭлементыФормы.КомандыПанели.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КомандыПанели.Кнопки.ВключитьКоличествоСтрок.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСумма");
	ЭтаФорма.ЭлементыФормы.КомандыПанели.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.КомандыПанели.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.ФильтрПодсистем.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборПоПодсистеме");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирИнтерфейснаяПанель_Форма_ФормаПросмотра(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирИнтерфейснаяПанель_Форма_Настройка(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирИсследовательОбъектов_Форма_ИсследовательКоллекций(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекции.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекции.Кнопки.РазличныеЗначенияКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокСПометками");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекции.Кнопки.Пустые.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПусто");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекции.Кнопки.КонсольКомпоновки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекции.Кнопки.КонсольКода.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКода");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекции.Кнопки.Справка.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКотекстныйСинтаксПомощник");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекции.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекции.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирИсследовательОбъектов_Форма_ИсследовательОбъектов(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.ДеревоЗначений.Колонки.Слово.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыСловПодсказки");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДерева.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДерева.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДерева.Кнопки.ПроверитьЦиклическиеСсылки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЦиклическиеСсылки");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДерева.Кнопки.КонсольКода.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКода");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДерева.Кнопки.Справка.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКотекстныйСинтаксПомощник");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДерева.Кнопки.АвтоКонтекстнаяПомощь.Картинка = ирКэш.КартинкаПоИмениЛкс("ирАвтоКонтекстнаяПомощь");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДерева.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДерева.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирИсторияДанных_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КПТипы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КПТипы.Кнопки.ОтборБезЗначения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КПТипы.Кнопки.ОткрытьОбъектМетаданных.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИнтерфейснаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_Данные.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_Данные.Кнопки.ОтборБезЗначения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КП_Данные.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КП_Данные.Кнопки.НайтиВФормеСпискаВерсий.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНайтиВСписке");
	ЭтаФорма.ЭлементыФормы.КП_Данные.Кнопки.ИсследоватьВерсию.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.Поля.Колонки.ОписаниеТипов.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КППоля.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КППоля.Кнопки.ОтборБезЗначения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКлсПолеТабличногоДокументаСГруппировками_Форма_ФормаМакет(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКлсПолеТекстовогоДокументаСКонтекстнойПодсказкой_Форма_ФормаМакет(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОбщая.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОбщая.Кнопки.СравнитьТекст.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОбщая.Кнопки.УстановитьФокус.Картинка = ирКэш.КартинкаПоИмениЛкс("ирУстановитьФокус");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОбщая.Кнопки.ПерейтиКОпределению.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПерейтиКОпределению");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОбщая.Кнопки.ПодменюПодсказка.Кнопки.АвтоКонтекстнаяПомощь.Картинка = ирКэш.КартинкаПоИмениЛкс("ирАвтоКонтекстнаяПомощь");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОбщая.Кнопки.ПодменюПодсказка.Кнопки.СинтаксПомощник.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСинтаксПомощник");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОбщая.Кнопки.ПодменюПодсказка.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.Закомментировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗакомментировать");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.Раскомментировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРаскомментировать");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.КонструкторЗапросовИР.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонструкторЗапроса");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.КонструкторЗапросов1С.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонструкторЗапроса");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.ВставитьИзБуфераОбменаВесьТекст.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.КопироватьВБуферОбменаВесьТекст.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.Форматировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирФорматировать");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.КопироватьВБуферОбменаТекстВВидеКода.Картинка = ирКэш.КартинкаПоИмениЛкс("ирАлгоритм");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель0.Кнопки.Выполнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыполнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель0.Кнопки.РедакторСтроковогоЛитерала.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедакторСтроковогоЛитерала");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель0.Кнопки.КонструкторЗапросов.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонструкторЗапроса");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель2.Кнопки.ВставитьИзБуфераОбменаВесьТекст.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель2.Кнопки.КопироватьВБуферОбменаВесьТекст.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКлсПолеТекстовогоДокументаСКонтекстнойПодсказкой_Форма_ФормаНастройки(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКлсПолеТекстовогоДокументаСКонтекстнойПодсказкой_Форма_ФормаПодсказки(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ТаблицаСлов.Колонки.Картинка.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыСловПодсказки");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.НеМетоды.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНеМетоды");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.НеСвойства.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНеСвойства");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.НеКлючевыеСлова.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНеКлючевыеСлова");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.ОткрытьОтладчик.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонфигуратор1С8");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКлсПолеТекстовогоДокументаСКонтекстнойПодсказкой_Форма_ФормаПример(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКлсПолеТекстовогоДокументаСКонтекстнойПодсказкой_Форма_КонструкторЗапроса(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ДоступныеТаблицы.Колонки.Имя.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТаблицыЗапроса");
	ЭтаФорма.ЭлементыФормы.ДоступныеТаблицы.Колонки.КоличествоСтрок.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирСумма");
	ЭтаФорма.ЭлементыФормы.ВыбранныеТаблицы.Колонки.Имя.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТаблицыЗапроса");
	ЭтаФорма.ЭлементыФормы.КПВыбранныеТаблицы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КПВыбранныеТаблицы.Кнопки.НайтиВСписке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНайтиВСписке");
	ЭтаФорма.ЭлементыФормы.КПВыбранныеТаблицы.Кнопки.ЗаменитьТаблицу.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗаменитьТаблицу");
	ЭтаФорма.ЭлементыФормы.КПВыбранныеТаблицы.Кнопки.ПреобразоватьВПодзапрос.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВложенныйЗапрос");
	ЭтаФорма.ЭлементыФормы.КПВыбранныеТаблицы.Кнопки.ВстроитьИзПодзапроса.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВложенныйЗапрос");
	ЭтаФорма.ЭлементыФормы.КПВыбранныеТаблицы.Кнопки.ПеренестиВоВременнуюТаблицу.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВременнаяТаблица");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляВыбора.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.ВыбранныеПоля.Колонки.Определение.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КПВыбранныеПоля.Кнопки.НайтиВСписке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНайтиВСписке");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляГруппировок.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КПГруппировки.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КПГруппировки.Кнопки.НайтиВСписке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНайтиВСписке");
	ЭтаФорма.ЭлементыФормы.ПоляДоступнойТаблицы.Колонки.Имя.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КПДеревоУсловия.Кнопки.НайтиВСписке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНайтиВСписке");
	ЭтаФорма.ЭлементыФормы.КПДеревоУсловия.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляУсловия.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КПТекст.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КПТекст.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляПсевдонима.Колонки.Определение.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КПОбъединениеПолей.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляИтоговОбъединения.Колонки.Имя.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КПГруппировкиИтогов.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляПорядкаЧастиОбъединения.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КППорядок.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляПорядкаОбъединения.Колонки.Имя.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КППараметры.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.СвязиТаблиц.Колонки.Таблица.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТаблицыЗапроса");
	ЭтаФорма.ЭлементыФормы.КПСвязи.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КПСвязи.Кнопки.НайтиВСписке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНайтиВСписке");
	ЭтаФорма.ЭлементыФормы.КПДеревоУсловияСвязи.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ВыборЛевогоЗначенияЭлементаУсловияСвязи.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.ВыборПравогоЗначенияЭлементаУсловияСвязи.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КППорядок1.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляИндекса.Колонки.Имя.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КПДоступныеТаблицы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КПДоступныеТаблицы.Кнопки.ОтборБезЗначенияВТекущейКолонке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КПДоступныеТаблицы.Кнопки.ПоказатьСтруктуруХранения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИндексы");
	ЭтаФорма.ЭлементыФормы.КПДоступныеТаблицы.Кнопки.ОткрытьОбъектМетаданных.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИнтерфейснаяПанель");
	ЭтаФорма.ЭлементыФормы.КПДоступныеТаблицы.Кнопки.ВключитьКоличествоСтрок.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСумма");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляВыбораПостроителя.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.ПоляВыбораПостроителя.Колонки.Определение.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КППорядокПостроителя.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КПИтогиПостроителя.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляУсловияПостроителя.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.ПоляОтбораПостроителя.Колонки.Определение.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляПорядкаПостроителя.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляИтоговПостроителя.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.ДоступныеВыбранныеПоляВыбораПостроителя.Колонки.Имя.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.ДоступныеВыбранныеПоляПорядкаПостроителя.Колонки.Имя.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.ДоступныеВыбранныеПоляОтбораПостроителя.Колонки.Определение.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.ДоступныеВыбранныеПоляИтоговПостроителя.Колонки.Имя.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКлсПолеТекстовогоДокументаСКонтекстнойПодсказкой_Форма_КонструкторВыраженияЗапроса(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирВыражение");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТекста.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоля.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КонтекстноеМенюФункций.Кнопки.СинтаксПомощник.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСинтаксПомощник");
	ЭтаФорма.ЭлементыФормы.КПЗапросы.Кнопки.ПеренестиВоВременнуюТаблицу.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВременнаяТаблица");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирВводВыраженияВстроенногоЯзыка_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонсольЗаданий_Форма_ДиалогНастройкиОбновленияСписка(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонсольЗаданий_Форма_ДиалогОтбораРегламентногоЗадания(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонсольЗаданий_Форма_ДиалогОтбораФоновогоЗадания(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонсольЗаданий_Форма_ДиалогРегламентногоЗадания(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПараметры.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПараметры.Кнопки.ИсследоватьПараметры.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонсольЗаданий_Форма_ДиалогФоновогоЗадания(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонсольЗаданий_Форма_ФормаКонсоли(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФоновыеЗадания.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФоновыеЗадания.Кнопки.ОтладчикФоновыхЗаданий.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонфигуратор1С8");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФоновыеЗадания.Кнопки.ЖурналРегистрации.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЖурнал");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФоновыеЗадания.Кнопки.ПерейтиКОпределениюМетода.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПерейтиКОпределению");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельМетоды.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельМетоды.Кнопки.ПодменюВыполнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыполнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельМетоды.Кнопки.ПоследниеВыбранные.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПоследниеВыбранные");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельМетоды.Кнопки.ПерейтиКОпределениюМетода.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПерейтиКОпределению");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРегламентныеЗадания.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРегламентныеЗадания.Кнопки.ПодменюВыполнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыполнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРегламентныеЗадания.Кнопки.ПоследниеВыбранные.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПоследниеВыбранные");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРегламентныеЗадания.Кнопки.Включить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВключено");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРегламентныеЗадания.Кнопки.СохранитьСписокВключенных.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСохранитьКак");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРегламентныеЗадания.Кнопки.ВключитьПоСпискуИзФайла.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОткрыть");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРегламентныеЗадания.Кнопки.Выключить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыключено");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРегламентныеЗадания.Кнопки.ВыключитьВсе.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыключено");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРегламентныеЗадания.Кнопки.ОбработатьВКонсолиКода.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКода");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРегламентныеЗадания.Кнопки.ЖурналРегистрации.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЖурнал");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРегламентныеЗадания.Кнопки.ПерейтиКОпределениюМетода.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПерейтиКОпределению");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонсольЗапросов_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирКонсольЗапросов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.Файл.Кнопки.ОбъединитьФайл.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОткрытьОбъединить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.НовыйФайл.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовыйФайл");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.СохранитьКак.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСохранитьКак");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.СохранитьОбъектДляОтладки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтладка");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.ВыполнитьЗапрос.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыполнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.ИсполняемыйЗапрос.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольЗапросов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.Открыть_КонсольКомпоновокДанных.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.РежимТранзакции.Картинка = ирКэш.КартинкаПоИмениЛкс("ирБлокировка");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.СверткаРезультаты.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСвертка");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.СохранитьРезультат.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТабличныйДокумент");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.ОткрытьОтладчик.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонфигуратор1С8");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.ДеревоЗапросов.Колонки.РазмерРезультата.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирСумма");
	ЭтаФорма.ЭлементыФормы.ДеревоЗапросов.Колонки.ДатаВыполнения.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирСердцебиение");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.ОткрытьТаблицу.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТаблицаЗначений");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.Свернуть.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСвернутьВсе");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.Развернуть.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРазвернутьВсе");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.ВставитьВТекстЗапроса.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСсылка");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.ПоказыватьИтоги.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСумма");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.Идентификаторы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПусто");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.СжатьКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСжатьКолонку");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.ШиринаКолонок.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКолонкаТабличногоПоля");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.ПерейтиКОпределению.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПерейтиКОпределению");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.ПоместитьВоВременнуюТаблицу.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВременнаяТаблица");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.КонсольКомпоновки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.ЗаполнитьГруппуДублейДляЗамены.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПоискИЗаменаДублей");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.РазличныеЗначенияКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокСПометками");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.СверткаПакет.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСвертка");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКоллекция.Кнопки.СверткаСвойства.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСвертка");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОбработкаСтрокиРезультата.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОбработкаСтрокиРезультата.Кнопки.Выполнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыполнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОбработкаСтрокиРезультата.Кнопки.ВыполнятьНаСервере.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыполнитьНаСервере");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОбработкаСтрокиРезультата.Кнопки.КонсольКода.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКода");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОбработкаСтрокиРезультата.Кнопки.ПолучитьТекст.Картинка = ирКэш.КартинкаПоИмениЛкс("ирАлгоритм");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОбработкаСтрокиРезультата.Кнопки.Вставка.Кнопки.СсылкаНаОбъектБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСсылка");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОбработкиРезультата.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОбработкиРезультата.Кнопки.Выполнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыполнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОбработкиРезультата.Кнопки.КонсольКода.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКода");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОбработкиРезультата.Кнопки.ПолучитьТекст.Картинка = ирКэш.КартинкаПоИмениЛкс("ирАлгоритм");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОбработкиРезультата.Кнопки.Вставка.Кнопки.СсылкаНаОбъектБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСсылка");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПараметры.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПараметры.Кнопки.НайтиПараметрВТексте.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНайтиВСписке");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПараметры.Кнопки.МенеджерТабличногоПоля.Картинка = ирКэш.КартинкаПоИмениЛкс("ирМенеджерТабличногоПоля");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПараметры.Кнопки.ИсследоватьТаблицуПараметров.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПараметры.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.ДеревоЗапроса.Колонки.Представление.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТаблицыЗапроса");
	ЭтаФорма.ЭлементыФормы.ДеревоЗапроса.Колонки.РазмерРезультата.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирСумма");
	ЭтаФорма.ЭлементыФормы.ДеревоЗапроса.Колонки.ДлительностьЧистая.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирЗамер");
	ЭтаФорма.ЭлементыФормы.РазмерКоллекции.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСумма");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТекстЗапроса.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТекстЗапроса.Кнопки.Вставка.Кнопки.СсылкаНаОбъектБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСсылка");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТекстЗапроса.Кнопки.Вставка.Кнопки.СсылкаИзБуфера.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЗапросаРезультата.Кнопки.СравнитьТекст.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЗапросаРезультата.Кнопки.ВыполнитьАнализТрассы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТехноЖурнал");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЗапросаРезультата.Кнопки.НастройкаТехножурнала.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНастройкаТехножурнала");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЗапросаРезультата.Кнопки.СтатистикаMSSQLПоПоследнимЗапросам.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСтатистикаСУБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПередВыполнениемЗапроса.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПередВыполнениемЗапроса.Кнопки.Выполнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыполнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПередВыполнениемЗапроса.Кнопки.КонсольКода.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКода");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПередВыполнениемЗапроса.Кнопки.ПолучитьТекст.Картинка = ирКэш.КартинкаПоИмениЛкс("ирАлгоритм");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличныйДокумент.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличныйДокумент.Кнопки.Автосумма.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСумма");
	ЭтаФорма.ЭлементыФормы.КомпоновщикДоступныеПоляОтбора.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КомпоновщикДоступныеПоляПорядка.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КомпоновщикДоступныеПоляВыбора.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляWMI.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.ДлительностьЗагрузки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЧасы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВыборки.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВыборки.Кнопки.МенеджерТабличногоПоля.Картинка = ирКэш.КартинкаПоИмениЛкс("ирМенеджерТабличногоПоля");
	ЭтаФорма.ЭлементыФормы.МенюДереваЗапросов.Кнопки.ДобавитьПапку.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДобавитьПапку");
	ЭтаФорма.ЭлементыФормы.МенюДереваЗапросов.Кнопки.ПоместитьВоВременныеТаблицы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВременнаяТаблица");
	ЭтаФорма.ЭлементыФормы.МенюДереваЗапросов.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ВременныеТаблицы.Колонки.РазмерРезультата.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирСумма");
	ЭтаФорма.ЭлементыФормы.КП_СвойстваСтрокиРезультата.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КП_СвойстваСтрокиРезультата.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.МенюДереваЗапроса.Кнопки.ВыполнитьПодзапрос.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыполнить");
	ЭтаФорма.ЭлементыФормы.МенюДереваЗапроса.Кнопки.ВыполнитьВсеЗапросыПакета.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыполнить2");
	ЭтаФорма.ЭлементыФормы.МенюДереваЗапроса.Кнопки.ВыполнитьЗапросыПакетаДоТекущего.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыполнить2");
	ЭтаФорма.ЭлементыФормы.МенюДереваЗапроса.Кнопки.ВыполнитьВсеПодзапросы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыполнить2");
	ЭтаФорма.ЭлементыФормы.МенюДереваЗапроса.Кнопки.ПреобразоватьВПодзапрос.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВложенныйЗапрос");
	ЭтаФорма.ЭлементыФормы.МенюДереваЗапроса.Кнопки.ВстроитьИзПодзапроса.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВложенныйЗапрос");
	ЭтаФорма.ЭлементыФормы.МенюДереваЗапроса.Кнопки.ПеренестиВНовыйЗапрос.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВременнаяТаблица");
	ЭтаФорма.ЭлементыФормы.МенюДереваЗапроса.Кнопки.ПерейтиКОпределению.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПерейтиКОпределению");
	ЭтаФорма.ЭлементыФормы.МенюДереваЗапроса.Кнопки.ПодкраситьЗависимыеЗапросы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПоискСсылокНаОбъект");
	ЭтаФорма.ЭлементыФормы.МенюДереваЗапроса.Кнопки.ЗависимыеЗапросы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПоискСсылокНаОбъект");
	ЭтаФорма.ЭлементыФормы.МенюДереваЗапроса.Кнопки.ОткрытьФормуСписка.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокЗначений");
	ЭтаФорма.ЭлементыФормы.МенюДереваЗапроса.Кнопки.ПоказатьСтруктуруХранения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИндексы");
	ЭтаФорма.ЭлементыФормы.МенюДереваЗапроса.Кнопки.СвернутьУзлы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСвернутьВсе");
	ЭтаФорма.ЭлементыФормы.МенюДереваЗапроса.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонсольЗапросов_Форма_ФормаНастройки(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонсольКода_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКода");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПараметры.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПараметры.Кнопки.НайтиПараметрВТексте.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНайтиВСписке");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПараметры.Кнопки.МенеджерТабличногоПоля.Картинка = ирКэш.КартинкаПоИмениЛкс("ирМенеджерТабличногоПоля");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПараметры.Кнопки.ИсследоватьЗначениеПараметра.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПараметры.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.Параметры.Колонки.Вход.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирВходящий");
	ЭтаФорма.ЭлементыФормы.Параметры.Колонки.Выход.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирВыходящий");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВстроенныйЯзык.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВстроенныйЯзык.Кнопки.ОткрытьВОтладчике.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонфигуратор1С8");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВстроенныйЯзык.Кнопки.ЗагрузитьИзмененияИзВнешнейОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗагрузка");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВстроенныйЯзык.Кнопки.СравнитьЗагрузитьИзмененияИзВнешнейОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВстроенныйЯзык.Кнопки.ВыполнитьАнализТрассы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТехноЖурнал");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВстроенныйЯзык.Кнопки.Вставка.Кнопки.СсылкаНаОбъектБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСсылка");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВстроенныйЯзык.Кнопки.Вставка.Кнопки.ЗначениеИзБуфера.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВстроенныйЯзык.Кнопки.Вставка.Кнопки.ВставитьУказаниеТипаПеременной.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТип");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВстроенныйЯзык.Кнопки.Вставка.Кнопки.НачалоЗамера.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗамер");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВстроенныйЯзык.Кнопки.Вставка.Кнопки.КонецЗамера.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗамер");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВстроенныйЯзык.Кнопки.ВычислитьВыражение.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыражение");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.НовыйФайл.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовыйФайл");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОбъединитьФайл.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОткрытьОбъединить");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СохранитьКак.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСохранитьКак");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.ДеревоАлгоритмов.Колонки.ДатаВыполнения.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирСердцебиение");
	ЭтаФорма.ЭлементыФормы.КП_Дерево.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонсольПостроителейОтчетов_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирКонсольПостроителейОтчетов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.ИсполняемыйЗапрос.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольЗапросов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельГруппировкиОбщая.Кнопки.ПеренестиВКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВправо");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельГруппировкиОбщая.Кнопки.ПеренестиВСтроки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВлево");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонсольПостроителейОтчетов_Форма_ФормаВыбораИзмерения(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонсольПостроителейОтчетов_Форма_ФормаВыбораОтчета(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонсольПостроителейОтчетов_Форма_ФормаВыбораСтрокиДереваЗапросов(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонсольПостроителейОтчетов_Форма_ФормаРедактированияЗапроса(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПараметры.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонсольПостроителейОтчетов_Форма_ФормаРедактированияМакета(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонсольПостроителейОтчетов_Форма_ФормаСохраненияНастроек(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонструкторРегулярногоВыражения_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирВыражение2");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.НовыйФайл.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовыйФайл");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СохранитьКак.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСохранитьКак");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ЗагрузитьПараметрыИзБуфераОбмена.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СгенерироватьПрограммныйКод.Картинка = ирКэш.КартинкаПоИмениЛкс("ирАлгоритм");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КПВыражение.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КПВыражение.Кнопки.УстановитьФокус.Картинка = ирКэш.КартинкаПоИмениЛкс("ирУстановитьФокус");
	ЭтаФорма.ЭлементыФормы.КПВыражение.Кнопки.ПерейтиКОпределению.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПерейтиКОпределению");
	ЭтаФорма.ЭлементыФормы.КПВыражение.Кнопки.ВставитьВыражение1С.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.КПВыражение.Кнопки.КопироватьРезультат.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КПВыражение.Кнопки.ПроверитьСинтаксис.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТестирование");
	ЭтаФорма.ЭлементыФормы.КПВыражение.Кнопки.ТестироватьRegexBuddy.Картинка = ирКэш.КартинкаПоИмениЛкс("ирRegexBuddy");
	ЭтаФорма.ЭлементыФормы.КП_ПроверочныйТекст.Кнопки.ОткрытьТаблицуРезультатов.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТаблицаЗначений");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонструкторРегулярногоВыражения_Форма_Настройки(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирМенеджерИнтерфейсов_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФорма.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирНастройкаЖурналаРегистрации_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирНастройкаЖурналаРегистрации");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КП_ДеревоСобытий.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_ДеревоСобытий.Кнопки.АнализЖурнала.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЖурнал");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирНастройкаЖурналаРегистрации_Форма_ФормаНастройкиДоступа(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПоляРегистрации.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирНастройкаЖурналаРегистрации_Форма_ФормаВыбораПолей(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирНастройкаЖурналаРегистрации_Форма_ФормаПроверкиМетаданных(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирНастройкаТехножурнала_Форма_ВыборШаблона(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ЗагрузитьИзФайла.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОткрыть");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирНастройкаТехножурнала_Форма_НастройкаКаталога(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КП_ДетальныйФильтрСобытий.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирНастройкаТехножурнала_Форма_НастройкаТехножурнала(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирНастройкаТехножурнала");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.Анализ.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТехноЖурнал");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ЗагрузитьШаблон.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОткрыть");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирНастройкаТехножурнала_Форма_СохранениеШаблона(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирНастройкаТехножурнала_Форма_ФильтрЗагрузкиПоТипамСобытий(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирНастройкаТехножурнала_Форма_УсловияЗаписиСвойства(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_ВыборОбъектаМетаданных(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ДеревоИсточников.Колонки.Представление.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирДеревоМетаданных");
	ЭтаФорма.ЭлементыФормы.ДеревоИсточников.Колонки.Имя.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирДеревоМетаданных");
	ЭтаФорма.ЭлементыФормы.ДеревоИсточников.Колонки.КоличествоСтрок.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирСумма");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ПоследниеВыбранные.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПоследниеВыбранные");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Обновить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСумма");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ФункциональныеОпции.Картинка = ирКэш.КартинкаПоИмениЛкс("ирФункциональнаяОпция");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОткрытьМетаданные.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИнтерфейснаяПанель");
	ЭтаФорма.ЭлементыФормы.ФильтрПодсистем.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборПоПодсистеме");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_ВыборПодсистемы(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_ВыборПользователяWindows(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_ВыборРедактируемыхТипов(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ТаблицаРедактируемыхТипов.Колонки.Представление.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирДеревоМетаданных");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТипов.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТипов.Кнопки.ОткрытьОбъектМетаданных.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИнтерфейснаяПанель");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_Граница(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_ДвоичныеДанные(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Исследовать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_ДеревоJSON(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирJSON");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_ЗначенияФункциональныхОпций(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_Массив(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Исследовать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.Получить.Кнопки.ЗаполнитьЗапросом.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗаполнитьЗапросом");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.Получить.Кнопки.ИзСписка.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОткрыть");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.Получить.Кнопки.ИзТекста.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПолеТекстовогоДокумента");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.Передать.Кнопки.ВСписок.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокЗначений");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.Передать.Кнопки.ВТаблицу.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТаблицаЗначений");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.Передать.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_МенеджерТабличногоПоля(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОтбор.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельОтбор.Кнопки.ОтборБезЗначенияВТекущейКолонке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПорядок.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.РазличныеЗначенияКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокСПометками");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОткрытьДанные.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТаблицаЗначений");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_МоментВремени(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Исследовать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_НастройкаОсторожностиВыборкиДанных(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_НастройкиАлгоритмов(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирНастройкиАлгоритмов");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_ОПодсистеме(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_ОткрытьОбъектДляОтладки(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирОтладка");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_ПараметрыВыводаСтрокТаблицы(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ИсполняемаяКомпоновка.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_ПараметрыЗаписиОбъектов(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_ПараметрыСоединенияСУБД(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_Пустышка(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_РазбивкаТекста(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ЗагрузитьИзФайла.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОткрыть");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_РегистрацияCOMКомпонент(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирCOMАдмин");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_РедакторДопустимыхТипов(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ТаблицаТипов.Колонки.Имя.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирДеревоМетаданных");
	ЭтаФорма.ЭлементыФормы.ДеревоТипов.Колонки.Имя.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирДеревоМетаданных");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_Служебная(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_СписокБазПользователяОС(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОткрытьМенеджерТабличногоПоля.Картинка = ирКэш.КартинкаПоИмениЛкс("ирМенеджерТабличногоПоля");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОтборБезЗначенияВТекущейКолонке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.РазличныеЗначенияКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокСПометками");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_СписокЗначений(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Исследовать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.Получить.Кнопки.ЗаполнитьЗапросом.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗаполнитьЗапросом");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.Получить.Кнопки.ИзМассива.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОткрыть");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.Получить.Кнопки.ИзТекста.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПолеТекстовогоДокумента");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.Передать.Кнопки.ВМассив.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокЗначений");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.Передать.Кнопки.ВТаблицу.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТаблицаЗначений");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.Передать.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_СтрокаТаблицы(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирСтрокаТаблицы");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Идентификаторы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПусто");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_СтруктураФормы(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_ТаблицаЗначений(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирТаблицаЗначений");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.Получить.Кнопки.ЗагрузитьИзMXL.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТабличныйДокумент");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.Получить.Кнопки.ЗаполнитьЗапросом.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗаполнитьЗапросом");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.Получить.Кнопки.ИзТекста.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПолеТекстовогоДокумента");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.Передать.Кнопки.ЗаполнитьГруппуДублейДляЗамены.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПоискИЗаменаДублей");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.Передать.Кнопки.ВЗапрос.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольЗапросов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.Передать.Кнопки.КонсольКомпоновки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.Передать.Кнопки.КонсольКода.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКода");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.Передать.Кнопки.ВыбратьИЗаполнитьОбъектБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗаполнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.Передать.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.Передать.Кнопки.ВСписок.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокЗначений");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.Передать.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.Передать.Кнопки.ПередатьВТаблицуБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВходящий");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.Колонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСвертка");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.РедакторСтроки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСтрокаТаблицы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.Идентификаторы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПусто");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.УстановитьЗначениеВКолонке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирУстановитьЗначениеВКолонке");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.РазличныеЗначенияКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокСПометками");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблица.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Исследовать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.ТаблицаКолонок.Колонки.ТипЗначения.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_ТабличныйДокумент(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличныйДокумент.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличныйДокумент.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличныйДокумент.Кнопки.ЗагрузитьВТаблицуЗначений.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТаблицаЗначений");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличныйДокумент.Кнопки.ОткрытьВExcel.Картинка = ирКэш.КартинкаПоИмениЛкс("ирExcel");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличныйДокумент.Кнопки.ПередатьВПодборИОбработкуОбъектов.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличныйДокумент.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличныйДокумент.Кнопки.Автосумма.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСумма");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличныйДокумент.Кнопки.Автоширина.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКолонкаТабличногоПоля");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличныйДокумент.Кнопки.РасшифровкаЯчейки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Исследовать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_Текст(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ПанельОсновная.Страницы.ВстроенныйЯзык.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирАлгоритм");
	ЭтаФорма.ЭлементыФормы.ПанельОсновная.Страницы.ЯзыкЗапросов.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирЗапрос");
	ЭтаФорма.ЭлементыФормы.ПанельОсновная.Страницы.HTML.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирHtml");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ОткрытьЧерезJSON.Картинка = ирКэш.КартинкаПоИмениЛкс("ирJSON");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ОткрытьЧерезXML.Картинка = ирКэш.КартинкаПоИмениЛкс("ирXML");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ЗагрузитьИзФайла.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОткрыть");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.СравнитьТекст.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_УникальныйИдентификатор(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_ФиксированныйСписокЗначений(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Исследовать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_ФормаВыбораСправкиПоСлову(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПлатформа_Форма_ХранилищеЗначения(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Исследовать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПодборИОбработкаОбъектов_Форма_ВыгрузкаВФайл(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирВыходящий");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПодборИОбработкаОбъектов_Форма_ЗаменитьСсылкиНаОбъекты(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирПоискИЗаменаДублей");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПодборИОбработкаОбъектов_Форма_Записать(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПодборИОбработкаОбъектов_Форма_ИзменитьДобавитьСтроку(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРеквизиты.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРеквизиты.Кнопки.ЗагрузитьИзОбъекта.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОткрыть");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРеквизиты.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПодборИОбработкаОбъектов_Форма_ИзменитьИдентификаторы(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирПоискИЗаменаДублей");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПодборИОбработкаОбъектов_Форма_ИзменитьПометкуНаУдаление(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПодборИОбработкаОбъектов_Форма_ИзменитьРегистрациюНаУзле(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПодборИОбработкаОбъектов_Форма_ОтменитьПроведениеДокументов(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПодборИОбработкаОбъектов_Форма_ОчиститьДвиженияДокументов(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПодборИОбработкаОбъектов_Форма_ПеренумерацияОбъектов(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПодборИОбработкаОбъектов_Форма_ПодборИОбработка(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКомпоновки.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКомпоновки.Кнопки.ИсполняемаяКомпоновка.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКомпоновки.Кнопки.ИсполняемыйЗапрос.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольЗапросов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеОбъекты.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеОбъекты.Кнопки.ЗаполнитьЗапросом.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗаполнитьЗапросом");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеОбъекты.Кнопки.ОтборБезЗначения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеОбъекты.Кнопки.ОтборПоЗначению.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборПоЗначению");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеОбъекты.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеОбъекты.Кнопки.МенеджерТабличногоПоля.Картинка = ирКэш.КартинкаПоИмениЛкс("ирМенеджерТабличногоПоля");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеОбъекты.Кнопки.ОткрытьТаблицу.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТаблицаЗначений");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеОбъекты.Кнопки.Идентификаторы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПусто");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДоступныеОбработки.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВыбранныеОбработки.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КомпоновщикДоступныеПоляОтбора.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КППорядок.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КПВыбор.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель3.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПодборИОбработкаОбъектов_Форма_ПровестиДокументы(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПодборИОбработкаОбъектов_Форма_ПроизвольныйАлгоритм(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирАлгоритм");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель.Кнопки.КонсольКода.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКода");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПодборИОбработкаОбъектов_Форма_Удалить(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПодборИОбработкаОбъектов_Форма_УдалитьСКонтролемСсылок(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирУдалитьСКонтролемСсылок");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПодборИОбработкаОбъектов_Форма_ШаблонОбработки(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПодготовкаКИзменениюСтруктурыБД_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирУдалениеТипов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЗатрагиваемыеЭлементыТекущегоПланаВидовХарактеристик.Кнопки.РедакторОбъектаБДСтроки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЭлементыТекущейГруппыРегистра.Кнопки.РедакторОбъектаБДСтроки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПоискБитыхСсылок_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирБитаяСсылка");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеОбъекты.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеОбъекты.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеОбъекты.Кнопки.ОткрытьТаблицу.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТаблицаЗначений");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеОбъекты.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.СвязанныеДанные.Колонки.ТипТаблицы.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТаблицыЗапроса");
	ЭтаФорма.ЭлементыФормы.КП_СвязанныеДанные.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_СвязанныеДанные.Кнопки.ОтборБезЗначения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КП_СвязанныеДанные.Кнопки.ОткрытьТаблицу.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТаблицаЗначений");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСтрокиТаблицыБД.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСтрокиТаблицыБД.Кнопки.Редактировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСтрокиТаблицыБД.Кнопки.Идентификаторы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПусто");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСтрокиТаблицыБД.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПоискДанных_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирПоискДанных");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель.Кнопки.ОткрыватьВРедактореОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПоискДублейИЗаменаСсылок_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирПоискИЗаменаДублей");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЭлементыТекущейГруппы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЭлементыТекущейГруппы.Кнопки.ПоискСсылок.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПоискСсылокНаОбъект");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЭлементыТекущейГруппы.Кнопки.РедакторОбъектаБДСтроки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЭлементыТекущейГруппы.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЭлементыТекущейГруппы.Кнопки.ОтборПоЗначению.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборПоЗначению");
	ЭтаФорма.ЭлементыФормы.НайденныеСсылки.Колонки.ИндексКартинки.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирСостоянияОбъекта");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНастройкиОтчета.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеСсылки.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеСсылки.Кнопки.ОтборБезЗначенияВТекущейКолонке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеСсылки.Кнопки.Состав.Кнопки.ИзЗапроса.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗаполнитьЗапросом");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеСсылки.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеСсылки.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеСсылки.Кнопки.КонсольКомпоновки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеГруппы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеГруппы.Кнопки.ПоискСсылок.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПоискСсылокНаОбъект");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеГруппы.Кнопки.РазличныеЗначенияКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокСПометками");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНайденныеГруппы.Кнопки.КонсольКомпоновки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЗаменаСсылок.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЗаменаСсылок.Кнопки.ПоискСсылок.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПоискСсылокНаОбъект");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЗаменаСсылок.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЗаменаСсылок.Кнопки.Идентификаторы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПусто");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЗаменаСсылок.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЦенностьДанных.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоля.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляДополнительныхПолей.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДополнительныеПоля.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КППравилаЗависимых.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КППравилаЗависимых.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляПар.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.ДлительностьПоследнегоПоиска.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗамер");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПоискДублейИЗаменаСсылок_Форма_ФормаНастройки(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПоискДублейИЗаменаСсылок_Форма_ФормаЗамещенияВНезависимыхРегистрахСведений(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПоискДублейИЗаменаСсылок_Форма_ФормаПерепроведенияДокументов(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПортативный_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирЛоготип16х16");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПравоЛево.Кнопки.НастройкиИнструментов.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельПравоЛево.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВерхНиз.Кнопки.НастройкиИнструментов.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВерхНиз.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПортативный_Форма_ПолучениеФорм(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПортативный_Форма_ФормаНастроек(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСписокОбработок.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирПортативный_Форма_ПерезапускСеансаОбычная(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирРазличныеЗначенияКолонки_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирСписокСПометками");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.РазличныеТипЗначений.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокСПометками");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Идентификаторы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПусто");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОткрытьТип.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТип");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОбработатьОбъекты.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирРедакторИзмененийНаУзлах_Форма_ВыборУзловПриемниковДляКопирования(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирРедакторИзмененийНаУзлах_Форма_ИзменениеНомеровСообщений(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирРедакторИзмененийНаУзлах_Форма_УправлениеГлавнымУзлом(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирРедакторИзмененийНаУзлах_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирИзмененияНаУзле");
	ЭтаФорма.ЭлементыФормы.ДеревоТаблиц.Колонки.Имя.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирДеревоМетаданных");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДереваОбъектов.Кнопки.СверткаСодержимое.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСвертка");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДереваОбъектов.Кнопки.ОткрытьМетаданные.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИнтерфейснаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДереваОбъектов.Кнопки.ОткрытьОбработкуОбъектов.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДереваОбъектов.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДереваОбъектов.Кнопки.ПоказатьСтруктуруХранения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИндексы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДереваОбъектов.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_ТаблицаИзменений.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_ТаблицаИзменений.Кнопки.СброситьНомер.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПовторить");
	ЭтаФорма.ЭлементыФормы.КП_ТаблицаИзменений.Кнопки.РедакторОбъектаБДСтроки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КП_ТаблицаИзменений.Кнопки.РедакторОбъектаБДЯчейки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КП_ТаблицаИзменений.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КП_ТаблицаИзменений.Кнопки.КонсольКомпоновки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.Узлы.Колонки.СобственныйУзел.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирПредопределенный");
	ЭтаФорма.ЭлементыФормы.КПУзлы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КПУзлы.Кнопки.РедактироватьОбъект.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КПУзлы.Кнопки.НайтиВСписке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНайтиВСписке");
	ЭтаФорма.ЭлементыФормы.КПУзлы.Кнопки.ВыгрузкаДанныхЧерезФайл.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыходящий");
	ЭтаФорма.ЭлементыФормы.КПУзлы.Кнопки.ОткрытьОбработкуОбъектов.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КПУзлы.Кнопки.ПоказатьСтруктуруХранения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИндексы");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирРедакторИзмененийНаУзлах_Форма_ФормаВыбораОбновленияРегистрации(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирРедакторКонстант_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирКонстанты");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.ПоследниеВыбранные.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПоследниеВыбранные");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.РедакторОбъектаБДСтроки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.ОтборБезЗначенияВТекущейКолонке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.ЖурналРегистрации.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЖурнал");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.ОткрытьОбъектМетаданных.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИнтерфейснаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирРедакторОбъектаБД_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюПрочее.Кнопки.ВыгрузитьВXML.Картинка = ирКэш.КартинкаПоИмениЛкс("ирXML");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюПрочее.Кнопки.ЗагрузитьИзXML.Картинка = ирКэш.КартинкаПоИмениЛкс("ирXML");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюПрочее.Кнопки.ДобавитьВИзбранное.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДобавитьВИзбранное");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюПрочее.Кнопки.КопироватьСсылку.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюПрочее.Кнопки.ЖурналРегистрации.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЖурнал");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюПрочее.Кнопки.Исследовать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюПрочее.Кнопки.ИзменитьИдентификатор.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПоискИЗаменаДублей");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюПрочее.Кнопки.УдалитьСКонтролемСсылок.Картинка = ирКэш.КартинкаПоИмениЛкс("ирУдалитьСКонтролемСсылок");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюПрочее.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюПрочее.Кнопки.СправкаМетаданного.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСправкаМетаданного");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюПрочее.Кнопки.ОткрытьОбъектМетаданных.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИнтерфейснаяПанель");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюТекущаяТаблица.Кнопки.Идентификаторы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПусто");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюТекущаяТаблица.Кнопки.УстановитьЗначениеВКолонке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирУстановитьЗначениеВКолонке");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюТекущаяТаблица.Кнопки.РазличныеЗначенияКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокСПометками");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюТекущаяТаблица.Кнопки.РедакторОбъектаБДЯчейки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюТекущаяТаблица.Кнопки.ЗаполнитьЗапросом.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗаполнитьЗапросом");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюТекущаяТаблица.Кнопки.ВыбратьИЗаполнитьОбъектБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗаполнить");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюТекущаяТаблица.Кнопки.СжатьКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСжатьКолонку");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюТекущаяТаблица.Кнопки.ШиринаКолонок.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКолонкаТабличногоПоля");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюТекущаяТаблица.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.НайтиВСписке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНайтиВСписке");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.НайтиВДинамическомСписке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокЗначений");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ОткрытьОсновнуюФормуИзмененногоОбъекта.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОткрытьИзмененый");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПоказатьРазличияБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.РедакторИзмененийНаУзле.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИзмененияНаУзле");
	ЭтаФорма.ЭлементыФормы.ПанельОсновная.Страницы.СтраницаИзмененияНаУзлах.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирИзмененияНаУзле");
	ЭтаФорма.ЭлементыФормы.ПанельОсновная.Страницы.СтраницаСсылкиНаОбъект.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирПоискСсылокНаОбъект");
	ЭтаФорма.ЭлементыФормы.ПанельОсновная.Страницы.СтраницаСвязанныеДанные.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирСвязаннаяТаблица");
	ЭтаФорма.ЭлементыФормы.ПанельОсновная.Страницы.ВерсииОбъекта.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирИсторияДанных");
	ЭтаФорма.ЭлементыФормы.РеквизитыТаблица.Колонки.Картинка.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыСловПодсказки");
	ЭтаФорма.ЭлементыФормы.СтраницыПанельДвижения.Колонки.ТипРегистра.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТаблицыЗапроса");
	ЭтаФорма.ЭлементыФормы.КП_СтраницыДвижения.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_СтраницыДвижения.Кнопки.ДинамическойСписок.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокЗначений");
	ЭтаФорма.ЭлементыФормы.ИзмененияНаУзлах.Колонки.УзелОбмена.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирСостоянияОбъекта");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДеревоУзлов.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДеревоУзлов.Кнопки.РедакторИзмененийНаУзлеПоОбъекту.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИзмененияНаУзле");
	ЭтаФорма.ЭлементыФормы.СвязанныеДанные.Колонки.ТипТаблицы.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТаблицыЗапроса");
	ЭтаФорма.ЭлементыФормы.КП_СвязанныеКолонки.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_СвязанныеКолонки.Кнопки.ОтборБезЗначения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КП_СвязанныеКолонки.Кнопки.ДинамическойСписок.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокЗначений");
	ЭтаФорма.ЭлементыФормы.КП_СвязанныеКолонки.Кнопки.ВыгрузитьВФайл.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыходящий");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСтрокиТаблицыБД.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСтрокиТаблицыБД.Кнопки.Редактировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСтрокиТаблицыБД.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНабораДвижений.Кнопки.РедакторОбъектаБДНабораДвижений.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНабораДвижений.Кнопки.РедакторСтрокиНабораДвижений.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСтрокаТаблицы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНабораЗаписей.Кнопки.РедакторСтроки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСтрокаТаблицы");
	ЭтаФорма.ЭлементыФормы.НайденныеСсылки.Колонки.ИндексКартинки.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирСостоянияОбъекта");
	ЭтаФорма.ЭлементыФормы.КП_СсылкиНаОбъект.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_СсылкиНаОбъект.Кнопки.СсылкиОтборБезЗначенияВТекущейКолонке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КП_СсылкиНаОбъект.Кнопки.СсылкиРедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КП_СсылкиНаОбъект.Кнопки.СсылкиКонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КП_СсылкиНаОбъект.Кнопки.СсылкиКонсольКомпоновки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляДополнительныхПолей.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДополнительныеПоля.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_СтраницыТабличныхЧастей.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличнаяЧасть.Кнопки.РедакторСтрокиТабличнойЧасти.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСтрокаТаблицы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВерсии.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВерсии.Кнопки.НайтиВФормеСпискаВерсий.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНайтиВСписке");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВерсии.Кнопки.НайтиВИсторииДанных.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсторияДанных");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВерсии.Кнопки.ИсследоватьВерсию.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВерсии.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВерсии.Кнопки.ОтборБезЗначения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирРедакторОбъектаБД_Форма_HTML(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирРедакторПараметровСеанса_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.Исследовать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.ЖурналРегистрации.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЖурнал");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирРедакторПользователей_Форма_ВыборПользователяWindows(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирРедакторПользователей_Форма_ЗапускПодПользователем(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирРедакторПользователей_Форма_ИзменениеВыбранныхПользователей(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирРедакторПользователей_Форма_ПользовательИнфобазы(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСпискаДоступныхРолей.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирРедакторПользователей_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирПользователи");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСпискаПользователей.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСпискаПользователей.Кнопки.ОбработатьВКонсолиКода.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКода");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСпискаПользователей.Кнопки.ОтборБезЗначенияВТекущейКолонке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСпискаПользователей.Кнопки.ОткрытьМенеджерТабличногоПоля.Картинка = ирКэш.КартинкаПоИмениЛкс("ирМенеджерТабличногоПоля");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСпискаПользователей.Кнопки.ЗапуститьПодПользователем.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПредприятие1С8");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСпискаПользователей.Кнопки.ЖурналРегистрации.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЖурнал");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСпискаПользователей.Кнопки.АнализПравДоступа.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПраваДоступа");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСпискаПользователей.Кнопки.ТехноЖурнал.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТехноЖурнал");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСпискаПользователей.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирРедакторПредопределенных_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирПредопределенный");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТипы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТипы.Кнопки.ОтборБезЗначения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТипы.Кнопки.ОткрытьОбъектМетаданных.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИнтерфейснаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_Данные.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_Данные.Кнопки.ОтборБезЗначения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КП_Данные.Кнопки.ОткрытьТаблицу.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТаблицаЗначений");
	ЭтаФорма.ЭлементыФормы.КП_Данные.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КП_Данные.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КП_Данные.Кнопки.ОткрытьДубли.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПоискИЗаменаДублей");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирРедакторХранилищНастроек_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНастроек.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНастроек.Кнопки.ВыгрузитьВФайл.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыходящий");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНастроек.Кнопки.ЗагрузитьИзФайла.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВходящий");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНастроек.Кнопки.ОтборБезЗначенияВТекущейКолонке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНастроек.Кнопки.Исследовать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНастроек.Кнопки.КонсольКомпоновки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНастроек.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельНастроек.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирРедакторХранилищНастроек_Форма_СериализацияЗначения(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Исследовать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирСинтаксПомощник_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирСинтаксПомощник");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельХтмл.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельХтмл.Кнопки.НайтиВДереве.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНайтиВДереве");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельХтмл.Кнопки.НайтиВИндексе.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНайтиВСписке");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельХтмл.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельХтмл.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельХтмл.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирСравнениеТаблиц_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.Файл1.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТабличныйДокумент");
	ЭтаФорма.ЭлементыФормы.Файл2.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТабличныйДокумент");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельКолонкиТаблицы1.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРезультат.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРезультат.Кнопки.Идентификаторы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПусто");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРезультат.Кнопки.РазличныеЗначенияКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокСПометками");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРезультат.Кнопки.РедакторОбъектаБДЯчейки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельРезультат.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.Таблица1.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТаблицаЗначений");
	ЭтаФорма.ЭлементыФормы.Таблица2.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТаблицаЗначений");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирСтруктураХраненияБД_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирИндексы");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ГлавнаяКоманднаяПанель.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КонтекстноеМенюТаблицы.Кнопки.ПоказатьИндексыВОбщейТаблицеИндексов.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНайтиВСписке");
	ЭтаФорма.ЭлементыФормы.КонтекстноеМенюТаблицы.Кнопки.ПоказатьПоляВОбщейТаблицеПолей.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНайтиВСписке");
	ЭтаФорма.ЭлементыФормы.КонтекстноеМенюТаблицы.Кнопки.ОткрытьФормуСписка.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокЗначений");
	ЭтаФорма.ЭлементыФормы.КонтекстноеМенюТаблицы.Кнопки.ОткрытьОбъектМетаданных.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИнтерфейснаяПанель");
	ЭтаФорма.ЭлементыФормы.КПТаблица.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КПТаблица.Кнопки.РазличныеЗначенияКолонки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокСПометками");
	ЭтаФорма.ЭлементыФормы.КПТаблица.Кнопки.ОтборБезЗначенияВТекущейКолонке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КПТаблица.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КонтекстноеМенюНаборыПолей.Кнопки.ПоказатьИндексВОбщейТаблицеИндексов.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНайтиВСписке");
	ЭтаФорма.ЭлементыФормы.КонтекстноеМенюПоле.Кнопки.ПоказатьПолеВОбщейТаблицеПолей.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНайтиВСписке");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирТестированиеМетаданных_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирТестирование");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.НовоеОкно.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирУдалениеОбъектовСКонтролемСсылок_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирУдалитьСКонтролемСсылок");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельУдаляемыхОбъектов.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельУдаляемыхОбъектов.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельУдаляемыхОбъектов.Кнопки.ОбработкаОбъектов.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельУдаляемыхОбъектов.Кнопки.ОтборБезЗначения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельУдаляемыхОбъектов.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельУдаляемыхОбъектов.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.УдаляемыеОбъекты.Колонки.Картинка.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирСостоянияСсылки");
	ЭтаФорма.ЭлементыФормы.СсылкиНаКандидата.Колонки.ИндексКартинки.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирСостоянияОбъекта");
	ЭтаФорма.ЭлементыФормы.КП_СсылкиНаУдаляемыеОбъекты.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_СсылкиНаУдаляемыеОбъекты.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КП_СсылкиНаУдаляемыеОбъекты.Кнопки.ОтборБезЗначения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КП_СсылкиНаУдаляемыеОбъекты.Кнопки.ОбработкаОбъектов.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КП_СсылкиНаУдаляемыеОбъекты.Кнопки.КонсольКомпоновки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляДополнительныхПолей.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДополнительныеПоля.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирУправлениеCOMКлассами1С_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирCOM");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСборкиПлатформы.Кнопки.ЗапуститьТолстый.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПредприятие1С8");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСборкиПлатформы.Кнопки.ЗапуститьТонкий.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПредприятие1С8");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирУправлениеИтогамиРегистров_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаРегистров.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаРегистров.Кнопки.ПоказатьСтруктуруХранения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИндексы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаРегистров.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаРегистров.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КППериоды.Кнопки.КомпоноватьОстаткиИОбороты.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.КППериоды.Кнопки.КомпоноватьОбороты.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.КППериоды.Кнопки.ДинамическийСписок.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокЗначений");
	ЭтаФорма.ЭлементыФормы.КППериоды.Кнопки.ОткрытьЗапросСатистики.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольЗапросов");
	ЭтаФорма.ЭлементыФормы.КППериоды.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирУправлениеИтогамиРегистров_Форма_УстановитьГраницыИтогов(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирУправлениеПрофайлами1С_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирНастройкиКлиента1С");
	ЭтаФорма.ЭлементыФормы.КПФайлы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КПФайлы.Кнопки.ОткрытьМенеджерТабличногоПоля.Картинка = ирКэш.КартинкаПоИмениЛкс("ирМенеджерТабличногоПоля");
	ЭтаФорма.ЭлементыФормы.КПФайлы.Кнопки.ОтборБезЗначенияВТекущейКолонке.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОтборБезЗначения");
	ЭтаФорма.ЭлементыФормы.КПФайлы.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КПФайлы.Кнопки.НайтиВПроводнике.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНайтиВСписке");
	ЭтаФорма.ЭлементыФормы.КПФайлы.Кнопки.ПометитьВсеНастройкиКонфигуратора.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонфигуратор1С8");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ВыгрузитьФайлы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыходящий");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ЗагрузитьФайлы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗагрузка");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирУправлениеСлужбамиСерверов1С_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирСистемнаяСлужба");
	ЭтаФорма.ЭлементыФормы.СлужбыАгентовСерверов.Колонки.Автозапуск.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирВключено");
	ЭтаФорма.ЭлементыФормы.СлужбыАгентовСерверов.Колонки.Выполняется.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирВыполнить");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Остановить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОстановить");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Перезапустить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПерезапустить");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОткрытьОснасткуУправленияСлужбами.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСистемнаяСлужба");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.КонсольСерверов.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольСерверов1С");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.СлужбыСерверовАдминистрирования.Колонки.Автозапуск.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирВключено");
	ЭтаФорма.ЭлементыФормы.СлужбыСерверовАдминистрирования.Колонки.Выполняется.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирВыполнить");
	ЭтаФорма.ЭлементыФормы.СлужбыСерверовОтладки.Колонки.Автозапуск.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирВключено");
	ЭтаФорма.ЭлементыФормы.СлужбыСерверовОтладки.Колонки.Выполняется.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирВыполнить");
	ЭтаФорма.ЭлементыФормы.СлужбыХранилищКонфигураций.Колонки.Автозапуск.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирВключено");
	ЭтаФорма.ЭлементыФормы.СлужбыХранилищКонфигураций.Колонки.Выполняется.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирВыполнить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонсольHTTPЗапросов_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирHttp");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельВыполнение.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.НовыйФайл.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовыйФайл");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОбъединитьФайл.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОткрытьОбъединить");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СохранитьКак.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСохранитьКак");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КП_Дерево.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КПТелоЗапроса.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КПТелоЗапроса.Кнопки.ЗагрузитьТекстИзФайла.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗагрузитьИзФайла");
	ЭтаФорма.ЭлементыФормы.КПТелоЗапроса.Кнопки.ЗагрузитьДвоичныеДанныеИзФайла.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗагрузитьИзФайла");
	ЭтаФорма.ЭлементыФормы.КПТелоЗапроса.Кнопки.JSON.Картинка = ирКэш.КартинкаПоИмениЛкс("ирJSON");
	ЭтаФорма.ЭлементыФормы.КПТелоЗапроса.Кнопки.XML.Картинка = ирКэш.КартинкаПоИмениЛкс("ирXML");
	ЭтаФорма.ЭлементыФормы.КП_ЗаголовкиЗапроса.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КПТелоОтвета.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КПТелоОтвета.Кнопки.JSON.Картинка = ирКэш.КартинкаПоИмениЛкс("ирJSON");
	ЭтаФорма.ЭлементыФормы.КПТелоОтвета.Кнопки.XML.Картинка = ирКэш.КартинкаПоИмениЛкс("ирXML");
	ЭтаФорма.ЭлементыФормы.КПТелоОтвета.Кнопки.HTML.Картинка = ирКэш.КартинкаПоИмениЛкс("ирHtml");
	ЭтаФорма.ЭлементыФормы.КП_ЗаголовкиОтвета.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_ЗаголовкиЗапроса2.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_ДанныеФормыЗапроса.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Обработка_ирКонсольHTTPЗапросов_Форма_Прокси(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Отчет_ирАнализПравДоступа_Форма_ФормаОтчета(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирПраваДоступа");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ИсполняемаяКомпоновка.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Копия.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТабличныйДокумент");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.НоваяКонсоль.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");

КонецПроцедуры

Процедура ИнициализироватьФорму_Отчет_ирАнализЗамераПроизводительности_Форма_ФормаОтчета(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирЗамер");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ИсполняемаяКомпоновка.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Копия.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТабличныйДокумент");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.НоваяКонсоль.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");

КонецПроцедуры

Процедура ИнициализироватьФорму_Отчет_ирКонсольКомпоновокДанных_Форма_Форма(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.ВыполнятьНаСервере.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыполнитьНаСервере");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.НастройкаОсторожностиВыборкиДанных.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОсторожный");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.КонструкторВыраженияКомпоновки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыражение");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.ВыполнитьАнализТрассы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТехноЖурнал");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.Исследовать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.ОтображатьНастройки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСвертка");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.НоваяКонсоль.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.ПанельРезультатов.Страницы.РезультатТабличныйДокумент.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирТабличныйДокумент");
	ЭтаФорма.ЭлементыФормы.ПанельРезультатов.Страницы.ТаблицаЗначений.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирТаблицаЗначений");
	ЭтаФорма.ЭлементыФормы.ПанельРезультатов.Страницы.ДеревоЗначений.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирДеревоЗначений");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСтруктура.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСтруктура.Кнопки.ЗагрузитьВариантНастроекСхемы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирЗагрузитьВариантНастроек");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельСтруктура.Кнопки.СохранитьВариантНастроекСхемы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСохранитьВариантНастроек");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель9.Кнопки.Исследовать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляПолейГруппировок.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляВыбора.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляОтбора.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель4.Кнопки.РасширенныйВыборЗначения.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСписокЗначений");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоляПорядка.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДеревоОтчетов.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДеревоОтчетов.Кнопки.Изменить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСхемаКомпоновкиДанных");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДеревоЗначений.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДеревоЗначений.Кнопки.ОткрытьТаблицу.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТаблицаЗначений");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДеревоЗначений.Кнопки.Свернуть.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСвернутьВсе");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДеревоЗначений.Кнопки.Развернуть.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРазвернутьВсе");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДеревоЗначений.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДеревоЗначений.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДеревоЗначений.Кнопки.ЗаполнитьГруппыДублейДляЗамены.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПоискИЗаменаДублей");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельДеревоЗначений.Кнопки.Идентификаторы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПусто");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаЗначений.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаЗначений.Кнопки.ОткрытьТаблицу.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТаблицаЗначений");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаЗначений.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаЗначений.Кнопки.РедакторОбъектаБД.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедактироватьОбъектБД");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаЗначений.Кнопки.КонсольОбработки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТаблицаЗначений.Кнопки.Идентификаторы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПусто");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличныйДокумент.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличныйДокумент.Кнопки.Сравнить1.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличныйДокумент.Кнопки.ИсследоватьРасшифровку.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличныйДокумент.Кнопки.ПередатьВПодборИОбработкуОбъектов.Картинка = ирКэш.КартинкаПоИмениЛкс("ирОбработкаОбъектов");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличныйДокумент.Кнопки.Копия.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТабличныйДокумент");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТабличныйДокумент.Кнопки.Автосумма.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСумма");
	ЭтаФорма.ЭлементыФормы.ПанельСхемы.Страницы.Запросы.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирЗапрос");
	ЭтаФорма.ЭлементыФормы.ПанельСхемы.Страницы.События.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирАлгоритм");
	ЭтаФорма.ЭлементыФормы.ПанельСхемы.ТекущаяСтраница.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирЗапрос");
	ЭтаФорма.ЭлементыФормы.КП_ВнешниеНаборыДанных.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_МакетКомпоновкиДанных.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КП_МакетКомпоновкиДанных.Кнопки.МакетКомпоновки.Картинка = ирКэш.КартинкаПоИмениЛкс("ирИсследовать");
	ЭтаФорма.ЭлементыФормы.КП_МакетКомпоновкиДанных.Кнопки.Сравнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Кнопки.СравнитьСРезультирующим.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.КП_ПолеВвода.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Копировать.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКопировать");
	ЭтаФорма.ЭлементыФормы.ДействияФормыАвто.Кнопки.БуферОбмена_Вставить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВставить");

КонецПроцедуры

Процедура ИнициализироватьФорму_Отчет_ирКонсольКомпоновокДанных_Форма_ФормаВыбораСтрокиДереваОтчетов(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Отчет_ирКонсольКомпоновокДанных_Форма_ФормаСохраненияНастроек(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Отчет_ирКонсольКомпоновокДанных_Форма_КонструкторВыраженияКомпоновки(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирВыражение");
	ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТекста.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДоступныеПоля.Колонки.Заголовок.КартинкиСтрок = ирКэш.КартинкаПоИмениЛкс("ирТипыДоступныхПолейКомпоновки");
	ЭтаФорма.ЭлементыФормы.КонтекстноеМенюФункций.Кнопки.СинтаксПомощник.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСинтаксПомощник");

КонецПроцедуры

Процедура ИнициализироватьФорму_Отчет_ирСтатистикаПоЗапросамСУБД_Форма_ФормаОтчета(ЭтаФорма) Экспорт

	ЭтаФорма.КартинкаЗаголовка = ирКэш.КартинкаПоИмениЛкс("ирСтатистикаСУБД");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ЗапросСтатистики.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольЗапросов");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ИсполняемаяКомпоновка.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКомпоновокДанных");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Копия.Картинка = ирКэш.КартинкаПоИмениЛкс("ирТабличныйДокумент");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.НоваяКонсоль.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНовоеОкно");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.СтруктураФормы.Картинка = ирКэш.КартинкаПоИмениЛкс("ирДеревоФормы");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");

КонецПроцедуры

Процедура ИнициализироватьФорму_Справочник_ирАлгоритмы_Форма_ФормаЭлемента(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОтображатьПараметры.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСвертка");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТекстАлгоритма.Кнопки.СгенерироватьМетод.Картинка = ирКэш.КартинкаПоИмениЛкс("ирГенератор");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТекстАлгоритма.Кнопки.КонсольКода.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКода");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТекстАлгоритма.Кнопки.ОткрытьВОтладчике.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонфигуратор1С8");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТекстАлгоритма.Кнопки.ПолеТекстовогоДокументаСКонтекстнойПодсказкой_ТекстАлгоритма_Выполнить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВыполнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТекстАлгоритма.Кнопки.ПолеТекстовогоДокументаСКонтекстнойПодсказкой_ТекстАлгоритма_РедакторСтроковогоЛитерала.Картинка = ирКэш.КартинкаПоИмениЛкс("ирРедакторСтроковогоЛитерала");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТекстАлгоритма.Кнопки.ПолеТекстовогоДокументаСКонтекстнойПодсказкой_ТекстАлгоритма_КонструкторЗапросов.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонструкторЗапроса");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТекстАлгоритма.Кнопки.ПолеТекстовогоДокументаСКонтекстнойПодсказкой_ТекстАлгоритма_СтруктураКоманднойПанели.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКоманднаяПанель");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТекстАлгоритма.Кнопки.ПолеТекстовогоДокументаСКонтекстнойПодсказкой_ТекстАлгоритма_СравнитьТекст.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСравнить");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТекстАлгоритма.Кнопки.ПолеТекстовогоДокументаСКонтекстнойПодсказкой_ТекстАлгоритма_УстановитьФокус.Картинка = ирКэш.КартинкаПоИмениЛкс("ирУстановитьФокус");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТекстАлгоритма.Кнопки.ПолеТекстовогоДокументаСКонтекстнойПодсказкой_ТекстАлгоритма_ПерейтиКОпределению.Картинка = ирКэш.КартинкаПоИмениЛкс("ирПерейтиКОпределению");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТекстАлгоритма.Кнопки.ПолеТекстовогоДокументаСКонтекстнойПодсказкой_ТекстАлгоритма_ПодменюПодсказка.Кнопки.ПолеТекстовогоДокументаСКонтекстнойПодсказкой_ТекстАлгоритма_АвтоКонтекстнаяПомощь.Картинка = ирКэш.КартинкаПоИмениЛкс("ирАвтоКонтекстнаяПомощь");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТекстАлгоритма.Кнопки.ПолеТекстовогоДокументаСКонтекстнойПодсказкой_ТекстАлгоритма_ПодменюПодсказка.Кнопки.ПолеТекстовогоДокументаСКонтекстнойПодсказкой_ТекстАлгоритма_СинтаксПомощник.Картинка = ирКэш.КартинкаПоИмениЛкс("ирСинтаксПомощник");
	ЭтаФорма.ЭлементыФормы.КоманднаяПанельТекстАлгоритма.Кнопки.ПолеТекстовогоДокументаСКонтекстнойПодсказкой_ТекстАлгоритма_ПодменюПодсказка.Кнопки.ПолеТекстовогоДокументаСКонтекстнойПодсказкой_ТекстАлгоритма_ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");
	ЭтаФорма.ЭлементыФормы.Параметры.Колонки.Вход.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирВходящий");
	ЭтаФорма.ЭлементыФормы.Параметры.Колонки.Выход.КартинкаШапки = ирКэш.КартинкаПоИмениЛкс("ирВыходящий");

КонецПроцедуры

Процедура ИнициализироватьФорму_Справочник_ирАлгоритмы_Форма_ФормаСписка(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.КонсольКода.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКода");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОбщаяФорма_НастройкиАлгоритмов_ОткрытьФорму.Картинка = ирКэш.КартинкаПоИмениЛкс("ирНастройкиАлгоритмов");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");

КонецПроцедуры

Процедура ИнициализироватьФорму_Справочник_ирКомандаРедактироватьОбъект_Форма_ФормаЭлемента(ЭтаФорма) Экспорт


КонецПроцедуры

Процедура ИнициализироватьФорму_Справочник_ирОбъектыДляОтладки_Форма_ФормаСписка(ЭтаФорма) Экспорт

	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Отладить.Картинка = ирКэш.КартинкаПоИмениЛкс("ирКонсольКода");
	ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ОПодсистеме.Картинка = ирКэш.КартинкаПоИмениЛкс("ирВопрос");

КонецПроцедуры

//#КонецОбласти

Процедура ДобавитьСвязиВнешнихМодулей()
	
	Для А = 0 По мВнешниеМодули.ВГраница() Цикл
		Для Б = 0 По мВнешниеМодули.ВГраница() Цикл		
			Если Б = А Тогда
				Продолжить;
			КонецЕсли; 
			ЭтотОбъект[мВнешниеМодули[А]][мВнешниеМодули[Б]] = ЭтотОбъект[мВнешниеМодули[Б]];
		КонецЦикла;
		//ЭтотОбъект[мВнешниеМодули[А]]["ирПортативный"] = ЭтаФорма;
	КонецЦикла;
	
КонецПроцедуры

Процедура Деструктор() Экспорт
	
	Если ирКэш.ЛиПортативныйРежимЛкс() Тогда
		Если ирКэш.ирПлатформа <> Неопределено Тогда 
			Если ирКэш.ирПлатформа.ирПортативный <> ЭтотОбъект Тогда // Такое возможно при вызове методов текущего объекта без открытия формы
				ирКэш.ирПлатформа.ирПортативный.Деструктор();
			Иначе
				ирКэш.ирПлатформа.ирКэш = Неопределено;
			КонецЕсли; 
		КонецЕсли; 
		ирКэш.ирПлатформа = Неопределено;
		Для А = 0 По мВнешниеМодули.ВГраница() Цикл
			УничтожаемыйМодуль = ЭтотОбъект[мВнешниеМодули[А]];
			Если УничтожаемыйМодуль <> Неопределено Тогда 
				Для Б = 0 По мВнешниеМодули.ВГраница() Цикл
					Если Б = А Тогда
						Продолжить;
					КонецЕсли; 
					УничтожаемыйМодуль[мВнешниеМодули[Б]] = Неопределено;
				КонецЦикла;
				УничтожаемыйМодуль["ирПортативный"] = Неопределено;
			Иначе
				// Такое возможно при вызове методов текущего объекта без открытия формы
				// при уничтожении неосновного экземпляра объекта ирПортативный
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 
	мВнешниеМодули.Очистить();
	
КонецПроцедуры  

Процедура УсловныйДеструктор() Экспорт

	Контейнер = Новый Структура();
	#Если Клиент Тогда
	Оповестить("ирПолучитьБазовуюФорму", Контейнер);
	#КонецЕсли
	Если Не Контейнер.Свойство("ирПортативный", ирПортативный) Тогда
		Деструктор();
	КонецЕсли; 
		
КонецПроцедуры // УсловныйДеструктор()
 
Функция ПолучитьНастройкиПоУмолчанию()
	
	Результат = Новый Структура;
	Результат.Вставить("РасположениеПанелиЗапуска", 3); // Сверху
	Результат.Вставить("ОпределениеСерверногоВремени", 1); 
	Возврат Результат;
	
КонецФункции

Функция ПрочитатьНастройки() Экспорт
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Результат = НастройкиПоУмолчанию;
	ПутьКФайлу = ПолучитьПолноеИмяФайлаНастроек();
	ФайлНастроек = Новый Файл(ПутьКФайлу);
	Если ФайлНастроек.Существует() Тогда
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.Прочитать(ПутьКФайлу);
		СтрокаXML = ТекстовыйДокумент.ПолучитьТекст();
		Попытка
			Результат = ирОбщий.ВосстановитьОбъектИзСтрокиXMLЛкс(СтрокаXML);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки; 
	КонецЕсли; 
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат); 
	Если Результат.Свойство("СписокИнструментов") Тогда
		Для Каждого СтрокаИнструмента Из Результат.СписокИнструментов Цикл
			СтрокаТЧ = СписокИнструментов.Найти(СтрокаИнструмента.ПолноеИмя, "ПолноеИмя");
			Если СтрокаТЧ <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаИнструмента, "Автозапуск, Видимость"); 
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 
	
КонецФункции

Функция ПолучитьПолноеИмяФайлаНастроек() Экспорт
	
	ПолноеИмяФайла = мКаталогОбработки + "DevToolSettings.xml";
	Возврат ПолноеИмяФайла;

КонецФункции

Функция ПолучитьВычисляемыйКонтекстОтладчика() Экспорт
	
	Если ирКэш.ЛиПортативныйРежимЛкс() Тогда
		Результат = "ВнешниеОбработки.Создать(""" + ЭтотОбъект.ИспользуемоеИмяФайла + """, Ложь).*()";
	ИначеЕсли ирКэш.ЛиЭтоРасширениеКонфигурацииЛкс() Тогда 
		Результат = "ирОбщий.*Лкс()";
	Иначе
		Результат = "*()";
	КонецЕсли; 
	Возврат Результат;

КонецФункции

Процедура ЗаписатьНастройки() Экспорт
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("РасположениеПанелиЗапуска", РасположениеПанелиЗапуска);
	СтруктураНастроек.Вставить("ОпределениеСерверногоВремени", ОпределениеСерверногоВремени);
	СтруктураНастроек.Вставить("СписокИнструментов", СписокИнструментов.Выгрузить());
	Попытка
		ПутьКФайлу = ПолучитьПолноеИмяФайлаНастроек();
		CтрокаXML = ирОбщий.СохранитьОбъектВВидеСтрокиXMLЛкс(СтруктураНастроек);
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(CтрокаXML);
		ТекстовыйДокумент.Записать(ПутьКФайлу);
	Исключение
		ВызватьИсключение "Не удалось записать настройки в файл " + ПутьКФайлу + ": " + ОписаниеОшибки(); 
	КонецПопытки;
	
КонецПроцедуры
  
Функция ТекстСкриптаПолученияВремени()

	Текст =
	"Function GetServerTime(ServerName) 
	|	Set objWMIService = GetObject(""winmgmts:\\"" & ServerName & ""\root\cimv2"") 
	|	Set colItems = objWMIService.ExecQuery(""Select * from Win32_LocalTime"") 
	|	zeroString = ""0""
	|	For Each objItem in colItems
	|		year_ = CStr(objItem.Year)
	|       If len(year_) < 4 Then
	|			year = String(zeroString, 4 - len(year_)) + year_
	|       End If
	|		month_ = CStr(objItem.Month)
	|       If len(month_) = 1 Then
	|			month_ = zeroString + month_
	|       End If
	|		day_ = CStr(objItem.Day)
	|       If len(day_) = 1 Then
	|			day_ = zeroString + day_
	|       End If
	|		hour_ = CStr(objItem.Hour)
	|       If len(hour_) = 1 Then
	|			hour_ = zeroString + hour_
	|       End If
	|		minute_ = CStr(objItem.Minute)
	|       If len(minute_) = 1 Then
	|			minute_ = zeroString + minute_
	|       End If
	|		second_ = CStr(objItem.Second)
	|       If len(second_) = 1 Then
	|			second_ = zeroString + second_
	|       End If    
	|
	|		GetServerTime = CStr(year_) & CStr(month_) & CStr(day_) & CStr(hour_) & CStr(minute_) & CStr(second_)
	|		'Exit Function
	|	Next
	|End Function";
	
	Возврат Текст;

КонецФункции // ТекстСкриптаПолученияВремени() 

Функция ПолучитьТекущуюДатуСервера() Экспорт
	
	Если ирКЭШ.Получить().ЭтоФайловаяБаза Или ОпределениеСерверногоВремени = 1 Тогда
		Возврат ТекущаяДата();
	ИначеЕсли ОпределениеСерверногоВремени = 2 Тогда 
		Возврат ПолучитьОперативнуюОтметкуВремени();
	ИначеЕсли ОпределениеСерверногоВремени = 3 Тогда 
		Попытка
			Возврат Дата(VBScript.Run("GetServerTime", мИмяСервера));			
		Исключение
			ВызватьИсключение "Не удалось получить время сервера с помощью скрипта! Выберите другую опцию получения серверного времени в настройках инструментов!";		
		КонецПопытки;
	Иначе
		Возврат ТекущаяДата();
	КонецЕсли; 
	
КонецФункции

Функция СтрокиРавныЛкс(Знач Строка1, Знач Строка2, СУчетомРегистра = Ложь, БезПравыхНепечатныхСимволов = Ложь) Экспорт
	
	Если Не СУчетомРегистра Тогда
		Строка1 = НРег(Строка1);
		Строка2 = НРег(Строка2);
	КонецЕсли; 
	Если БезПравыхНепечатныхСимволов Тогда
		Строка1 = СокрП(Строка1);
		Строка2 = СокрП(Строка2);
	КонецЕсли; 
	Результат = Строка1 = Строка2;
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПолноеИмяФайлаПортативногоОбъектаМетаданныхЛкс(ИмяОбъекта, ТипМетаданных = "Обработка") Экспорт

	Если Ложь
		Или СтрокиРавныЛкс(ТипМетаданных, "Обработка") 
		Или СтрокиРавныЛкс(ТипМетаданных, "ВнешняяОбработка")
	Тогда
		Расширение = "epf";
	ИначеЕсли Ложь
		Или СтрокиРавныЛкс(ТипМетаданных, "Отчет") 
		Или СтрокиРавныЛкс(ТипМетаданных, "ВнешнийОтчет")
	Тогда
		Расширение = "erf";
	Иначе
		ВызватьИсключение "Тип метаданных """ + ТипМетаданных + """ не поддерживается";
	КонецЕсли;
	Если ИмяОбъекта = Метаданные().Имя Тогда
		Результат = мКаталогОбработки + "" + ИмяОбъекта + "." + Расширение;
	Иначе
		Результат = мКаталогОбработки + "Модули\" + ИмяОбъекта + "." + Расширение;
	КонецЕсли; 
	Возврат Результат;

КонецФункции

Функция ПолучитьОбщийМодульЛкс(Имя, ДобавитьСсылкиНаВнешниеМодули = Истина) Экспорт
	
	Результат = ЭтотОбъект[Имя];
	Если Результат = Неопределено Тогда
		ПолноеИмяФайла = ПолучитьПолноеИмяФайлаПортативногоОбъектаМетаданныхЛкс(Имя);
		Результат = ВнешниеОбработки.Создать(ПолноеИмяФайла, Ложь);
	КонецЕсли; 
	Если ДобавитьСсылкиНаВнешниеМодули Тогда
		Для Каждого ИмяМодуля Из мВнешниеМодули Цикл
			Попытка
				Результат[ИмяМодуля] = ЭтотОбъект[ИмяМодуля];
			Исключение
			КонецПопытки; 
		КонецЦикла;
	КонецЕсли;
	Попытка
		Результат["ирПортативный"] = ЭтотОбъект;
	Исключение
	КонецПопытки; 
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМенеджерТипаМетаданныхЛкс(ТипМетаданных) Экспорт

	Если Ложь
		Или СтрокиРавныЛкс(ТипМетаданных, "Обработка") 
		Или СтрокиРавныЛкс(ТипМетаданных, "ВнешняяОбработка")
	Тогда
		Менеджер = ВнешниеОбработки;
	ИначеЕсли Ложь
		Или СтрокиРавныЛкс(ТипМетаданных, "Отчет") 
		Или СтрокиРавныЛкс(ТипМетаданных, "ВнешнийОтчет")
	Тогда
		Менеджер = ВнешниеОтчеты;
	Иначе
		ВызватьИсключение "Тип метаданных """ + ТипМетаданных + """ не поддерживается";
	КонецЕсли;
	Возврат Менеджер;

КонецФункции

Функция ПолучитьФормуЛкс(ИмяФормы, Параметры = Неопределено, Владелец = Неопределено, Уникальность = Неопределено, Окно = Неопределено) Экспорт
	
	Возврат мПолучениеФорм.ПолучитьФормуЛкс(ИмяФормы, Параметры, Владелец, Уникальность, Окно);
	
КонецФункции

Функция КартинкаПоИмениЛкс(ИмяКартинки) Экспорт
	
	Пустышка = Новый Структура(ИмяКартинки);
	ЗаполнитьЗначенияСвойств(Пустышка, БиблиотекаКартинок); 
	Картинка = Пустышка[ИмяКартинки];
	Если Картинка = Неопределено Тогда
		Картинка = мКартинки.Рисунки[ИмяКартинки].Картинка;
	КонецЕсли; 
	Возврат Картинка;
	
КонецФункции

Функция ПолучитьКаталогОбъектовДляОтладкиЛкс() Экспорт

	Результат = мКаталогОбработки + "ОбъектыДляОтладки\";
	ИмяКаталогаБазы = ирКэш.Получить().ПолучитьИдентификаторИзПредставления(СтрокаСоединенияИнформационнойБазы());
	Результат = Результат + ИмяКаталогаБазы + "\";
	Каталог = Новый Файл(Результат);
	Если Не Каталог.Существует() Тогда
		СоздатьКаталог(Результат);
	КонецЕсли; 
	Возврат Результат;

КонецФункции // ПолучитьКаталогОбъектовДляОтладкиЛкс()

Функция КэшФункцииЛкс(ИмяФункции) Экспорт 
	
	Если мКэшФункций = Неопределено Тогда
		мКэшФункций = Новый Соответствие;
	КонецЕсли; 
	КэшФункции = мКэшФункций[ИмяФункции];
	Если КэшФункции = Неопределено Тогда
		КэшФункции = Новый Соответствие;
		мКэшФункций[ИмяФункции] = КэшФункции;
	КонецЕсли; 
	Возврат КэшФункции;
	
КонецФункции

Процедура ОбновитьПовторноИспользуемыеЗначенияЛкс() Экспорт 
	
	мКэшФункций = Неопределено;
	
КонецПроцедуры

Функция ЛиСерверныйМодульДоступенЛкс(ТолькоДляЗаписи = Истина) Экспорт 
	
	Если мСерверныйМодульДоступен = Неопределено Тогда 
		мСерверныйМодульДоступен = Ложь;
		ПолноеИмяФайлаМодуляЗаписи = ПолучитьПолноеИмяФайлаПортативногоОбъектаМетаданныхЛкс("ирПортативныйСервер");
		Если Метаданные.ОбщиеМодули.Найти("ДополнительныеОтчетыИОбработкиВызовСервера") <> Неопределено Тогда
			ИмяОбщегоМодуляСВызовомСервера = "ДополнительныеОтчетыИОбработкиВызовСервера";
		ИначеЕсли Метаданные.ОбщиеМодули.Найти("ДополнительныеОтчетыИОбработки") <> Неопределено Тогда
			ИмяОбщегоМодуляСВызовомСервера = "ДополнительныеОтчетыИОбработки";
		Иначе
			ИмяОбщегоМодуляСВызовомСервера = "";
		КонецЕсли; 
		Если ИмяОбщегоМодуляСВызовомСервера <> "" Тогда
			мДополнительныеОтчетыИОбработки = Вычислить(ИмяОбщегоМодуляСВызовомСервера);
			Если Истина
				И (Ложь
					Или ирОбщий.МетодРеализованЛкс(мДополнительныеОтчетыИОбработки, "ВыполнитьКомандуНаСервере")
					Или ирОбщий.МетодРеализованЛкс(мДополнительныеОтчетыИОбработки, "ВыполнитьКоманду"))
				И Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки") <> Неопределено 
			Тогда 
				Если мСерверныйМодульСсылка = Неопределено Тогда
					ФайлМодуля = Новый Файл(ПолноеИмяФайлаМодуляЗаписи);
					ОбъектМодуля = ВнешниеОбработки.Создать(ПолноеИмяФайлаМодуляЗаписи, Ложь);
					СведенияМодуля = ОбъектМодуля.СведенияОВнешнейОбработке();
					ИмяБезРасширения = ФайлМодуля.ИмяБезРасширения;
					Попытка
						мСерверныйМодульСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ИмяБезРасширения);
					Исключение
						// Разделенная база в неразделенном сеансе
						мСерверныйМодульСсылка = Неопределено;
					КонецПопытки;
					Если Не ЗначениеЗаполнено(мСерверныйМодульСсылка) Тогда 
						ОбъектСправочника = Справочники.ДополнительныеОтчетыИОбработки.СоздатьЭлемент();
						ОбъектСправочника.БезопасныйРежим = Ложь;
					Иначе
						ОбъектСправочника = мСерверныйМодульСсылка.ПолучитьОбъект();
					КонецЕсли; 
					Если ОбъектСправочника.Версия <> СведенияМодуля.Версия Тогда
						ОбъектСправочника.Наименование = ФайлМодуля.ИмяБезРасширения;
						ОбъектСправочника.Версия = СведенияМодуля.Версия;
						ОбъектСправочника.Информация = "Серверный модуль портативного варианта подсистемы ""Инструменты разработчика""";
						ОбъектСправочника.ИмяФайла = ФайлМодуля.Имя;
						ОбъектСправочника.ХранилищеОбработки = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ФайлМодуля.ПолноеИмя));
						ОбъектСправочника.ОбменДанными.Загрузка = Истина; // Позволяет обойти плохие обработчики записи (передачу мутальных значений параметров)
						Попытка
							ОбъектСправочника.Записать();
							Успех = Истина;
						Исключение
							Успех = Ложь;
							Сообщить("Не удалось записать служебный элемент " + ФайлМодуля.ИмяБезРасширения + " справочника ДополнительныеОтчетыИОбработки: " + ОписаниеОшибки());
						КонецПопытки;
						Если Успех Тогда
							Сообщить("Зарегистрирован/обновлен элемент " + ФайлМодуля.ИмяБезРасширения + " справочника ДополнительныеОтчетыИОбработки");
						КонецЕсли; 
						мСерверныйМодульСсылка = ОбъектСправочника.Ссылка;
					КонецЕсли; 
					мСерверныйМодульДоступен = Не ОбъектСправочника.Модифицированность();
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
		//Если Не мСерверныйМодульДоступен Тогда
		//	Сообщить("Серверный модуль недоступен! Весь код будет выполняться на клиенте.", СтатусСообщения.Внимание);
		//КонецЕсли; 
	КонецЕсли; 
	Результат = мСерверныйМодульДоступен;
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьСерверныйМетодЛкс(ИмяМетода, Параметры) Экспорт 
	
	Если мСерверныйМодульЗаписиДоступен = Истина Тогда
		Если мМодульЗаписиВнешнегоСоединения = Неопределено Тогда
			ПолноеИмяФайлаМодуляЗаписи = ПолучитьПолноеИмяФайлаПортативногоОбъектаМетаданныхЛкс("ирПортативныйСервер");
			Попытка
				ВнешнееСоединение = ирОбщий.ПолучитьСобственноеВнешнееСоединениеЛкс();
				мМодульЗаписиВнешнегоСоединения = ВнешнееСоединение.ВнешниеОбработки.Создать(ПолноеИмяФайлаМодуляЗаписи, Ложь);
				Сообщить("Подключено внешнее соединение для эмуляции выполнения записи на сервере");
			Исключение
				Сообщить("Ошибка подключения внешнего соединения для эмуляции выполнения записи на сервере: " + ОписаниеОшибки());
				мМодульЗаписиВнешнегоСоединения = "";
			КонецПопытки;
		КонецЕсли;
		Если мМодульЗаписиВнешнегоСоединения <> Неопределено И мМодульЗаписиВнешнегоСоединения <> "" Тогда
			мМодульЗаписиВнешнегоСоединения.ВыполнитьКомандуНаСервере(ИмяМетода, Параметры);
		Иначе
			Сообщить("Выполнение серверного метода невозможно, т.к. серверный модуль во внешнем соединении не подключен", СтатусСообщения.Внимание);
		КонецЕсли; 
	Иначе
		Параметры.Вставить("ДополнительнаяОбработкаСсылка", мСерверныйМодульСсылка);
		Параметры.Вставить("ИдентификаторКоманды", ИмяМетода);
		Параметры.Вставить("РезультатВыполнения", Новый Структура);
		Если ирОбщий.МетодРеализованЛкс(мДополнительныеОтчетыИОбработки, "ВыполнитьКомандуНаСервере") Тогда 
			мДополнительныеОтчетыИОбработки.ВыполнитьКомандуНаСервере(Параметры);
		Иначе
			мДополнительныеОтчетыИОбработки.ВыполнитьКоманду(Параметры);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

ЗащитаОтОпасныхДействийЛ = Неопределено;
Попытка
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	ЗащитаОтОпасныхДействийЛ = ТекущийПользователь.ЗащитаОтОпасныхДействий;
Исключение
КонецПопытки;
Если Истина
	И ЗащитаОтОпасныхДействийЛ <> Неопределено
	И ЗащитаОтОпасныхДействийЛ.ПредупреждатьОбОпасныхДействиях 
Тогда 
	Сообщить("У текущего пользователя ИБ включен флажок ""Защита от опасных действий"". Для корректной работы инструментов его рекомендуется выключить!", СтатусСообщения.Внимание);
КонецЕсли; 

мВнешниеМодули = Новый Массив();
мВнешниеМодули.Добавить("ирКэш");
мВнешниеМодули.Добавить("ирОбщий");
мВнешниеМодули.Добавить("ирПривилегированный");
мВнешниеМодули.Добавить("ирСервер");
мВнешниеМодули.Добавить("ирПортативный");
ирПортативный = ЭтотОбъект;
#Если Сервер И Не Сервер Тогда
	// В конфигурации нужно, чтобы форма при создании не вызывала исключение
	СлужебныйМодульЛ = Обработки.ирСлужебный.Создать();
	ирКэш = СлужебныйМодульЛ.ПолучитьОбщийМодульКонфигурацииЛкс("ирКэш");
	ирОбщий = СлужебныйМодульЛ.ПолучитьОбщийМодульКонфигурацииЛкс("ирОбщий");
	ирСервер = СлужебныйМодульЛ.ПолучитьОбщийМодульКонфигурацииЛкс("ирСервер");
	ирПривилегированный = СлужебныйМодульЛ.ПолучитьОбщийМодульКонфигурацииЛкс("ирПривилегированный");
	мКаталогОбработки = ирКэш.Получить().КаталогФайловогоКэша + "\"; 
	мНеПодключеныОбработки = Ложь;
	Перейти ~Конец;
#КонецЕсли
//Если Ложь Тогда 
//	Пр(1);  // Ошибка компиляции здесь свидетельствует о том, что в модуле отсутствуют подмены глобальных методов подсистемы для отладки
//КонецЕсли;
мНеПодключеныОбработки = Истина;
ЭтотФайл = Новый Файл(ЭтотОбъект.ИспользуемоеИмяФайла);
Если Не ЭтотФайл.Существует() Тогда
	// Внешняя обработка открыта на клиенте пользователем и сейчас создается ее объект на сервере
	Перейти ~Конец;
КонецЕсли; 
мКаталогОбработки = ЭтотФайл.Путь;
мКэшФункций = Новый Соответствие;
Попытка
	ирКэш = ПолучитьОбщийМодульЛкс("ирКэш", Ложь);
	ирОбщий = ПолучитьОбщийМодульЛкс("ирОбщий", Ложь);
	ирСервер = ПолучитьОбщийМодульЛкс("ирСервер", Ложь);
	ирПривилегированный = ПолучитьОбщийМодульЛкс("ирПривилегированный", Ложь);
	//ирПлатформа = ПолучитьОбщийМодульЛкс("ирПлатформа");
	мНеПодключеныОбработки = Ложь;
	ДобавитьСвязиВнешнихМодулей();
	
	//ирКаталогАлгоритмов = мКаталогОбработки + "Алгоритмы\";
	//мКлючОбъектаДляСохраненияОбъектовОтладки = "ирИнструментыРазработчикаПортативные-ирОбъектыДляОтладки";
	мКартинки = ПолучитьМакет("ОбщиеКартинки");
	#Если Клиент Тогда
		мПолучениеФорм = ПолучитьФорму("ПолучениеФорм");
	#КонецЕсли 
	мИмяСервера = НСтр(СтрокаСоединенияИнформационнойБазы(), "Srvr");
	Если мИмяСервера <> "" Тогда
		мИмяСервера = ирОбщий.ПолучитьПервыйФрагментЛкс(мИмяСервера, ",");	
		мИмяСервера = ирОбщий.ПолучитьПервыйФрагментЛкс(мИмяСервера, ":");
	КонецЕсли;                     

	Попытка
		VBScript = Новый COMОбъект("MSScriptControl.ScriptControl");
		VBScript.language = "vbscript";
		VBScript.AddCode(ТекстСкриптаПолученияВремени());
	Исключение
		// В 64-битном процессе этот класс недоступен
		VBScript = Неопределено;
	КонецПопытки;

	//ирКЭШ_СловарьШаблоновМетаданных = Новый Соответствие;
	//ирКЭШ_СтруктураХраненияБД = Новый Соответствие;
	//ирКЭШ_КомпоновщикТаблицыМетаданных = Новый Соответствие;

	мВерсия = "5.22p"; // Здесь выполняется программная замена при выпуске портативной версии
Исключение
	ОписаниеОшибки = ОписаниеОшибки(); // Для отладки
	мНеПодключеныОбработки = Истина;
	Если ирКэш <> Неопределено Тогда
		Деструктор();
	КонецЕсли; 
	ВызватьИсключение; 
КонецПопытки;
~ПрочитатьНастройки:
ПрочитатьНастройки();
мКэшТиповВнешнихМетаданных = Новый Соответствие;
~Конец:
