&НаКлиенте
Перем Прошедший, Следующий;

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	// По умолчанию считаем, что Смена года в новый год идёт 
	// с текущего года документа на следующий
	
	//Если Объект.Годы = Неопределено Тогда
	//	Год = Число(Формат(Элемент.Значение, "ДФ=гггг"));
	//	СледГод = Год + 1;
	//	Сообщить(Год);
	//	Сообщить(СледГод);
	//	Объект.Годы = Год + "/" + СледГод;
	//КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ГодыИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	// Смена "Годов" на новый год должна идти последовательно (подряд)
	Перем НачалоКолонки, Прошедший, Следующий;
	СтандартнаяОбработка = Ложь;
	КорректныйГод = Ложь;
	ИзменённыйГод = ИзменёнГод(Элемент);
	
	Элемент.ПолучитьГраницыВыделения(0, НачалоКолонки, 0, 0);
	ПолучитьГоды(Элемент, Прошедший, Следующий);
	
	Если ИзменённыйГод = 1 И ЗаполненГод(Прошедший) Тогда
		КорректныйГод = Истина;
		Следующий = Прошедший + 1;
	КонецЕсли;
	Если ИзменённыйГод = 2 И ЗаполненГод(Следующий) Тогда
		КорректныйГод = Истина;
		Прошедший = Следующий - 1;
	КонецЕсли;
	
	Если КорректныйГод = Истина Тогда
		ЗаписатьГоды(Прошедший, Следующий);
		Элемент.УстановитьГраницыВыделения(1, НачалоКолонки, 1, НачалоКолонки);
		КорректныйГод = Ложь; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьГоды(Элемент, Прошедший, Следующий)
 	Годы = СтрРазделить(Элемент.ТекстРедактирования, "/");
	Прошедший = Число(Годы[0]);
	Следующий = Число(Годы[1]);
КонецФункции	

&НаКлиенте
Функция ЗаписатьГоды(Прошедший, Следующий)
	Объект.Годы = СтрЗаменить(Строка(Прошедший), Символы.НПП, "") + "/" + СтрЗаменить(Строка(Следующий), Символы.НПП, "");
КонецФункции

//&НаКлиенте
//Функция ЗаполненыГоды()
//	Перем Прошедший, Следующий;
//	ПолучитьГоды(Прошедший, Следующий);
//	Если Прошедший >=1000 И Прошедший <= 9999 И Следующий >=1000 И Следующий <= 9999 Тогда
//		Возврат Истина;
//	Иначе
//		Возврат Ложь;
//	КонецЕсли;
//КонецФункции

&НаКлиенте
Функция ИзменёнГод(Элемент)
	Перем НовыйПрошедший, НовыйСледующий;
	ПолучитьГоды(Элемент, НовыйПрошедший, НовыйСледующий);
	Если Прошедший <> НовыйПрошедший Тогда
		Прошедший = НовыйПрошедший;
		Возврат 1;
	КонецЕсли;
	Если Следующий <> НовыйСледующий Тогда
		Следующий = НовыйСледующий;
		Возврат 2;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

&НаКлиенте
Функция ЗаполненГод(Год)
	Год = Число(Год);
	Если Год >=1000 И Год <= 9999 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции