&НаКлиенте
Перем Прошедший, Следующий, ГраницыВыделения;

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	// По умолчанию считаем, что Смена года в новый год идёт 
	// с текущего года документа на следующий
	Перем Прош, След;
	ПолучитьГоды(Элемент, Прош, След);
	ГодПустой = не (ЗаполненГод(Прош) И ЗаполненГод(След));
	
	Если Объект.Годы = Null Или ГодПустой Тогда
		Год = Число(Формат(Объект.Дата, "ДФ=гггг"));
		Если ЗаполненГод(Год) Тогда
			ДописатьГоды(Год, Год + 1);
		КонецЕсли;
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ГодыИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	// Смена "Годов" на новый год должна идти последовательно (подряд)
	Перем А, Б, В, КонецКолонки, Прошедший, Следующий;
	КорректныйГод = Ложь;
	ИзменённыйГод = ИзменёнГод(Элемент);
	
	Элемент.ПолучитьГраницыВыделения(А, Б, В, КонецКолонки);
	ПолучитьГоды(Элемент, Прошедший, Следующий);
	
	Если ИзменённыйГод = 1 И ЗаполненГод(Прошедший) Тогда
		КорректныйГод = Истина;
		Следующий = Прошедший + 1;
	ИначеЕсли ИзменённыйГод = 2 И ЗаполненГод(Следующий) Тогда
		КорректныйГод = Истина;
		Прошедший = Следующий - 1;
	КонецЕсли;
	
	Если КорректныйГод = Истина Тогда
		ГраницыВыделения = Новый Структура;
		ГраницыВыделения.Вставить("НачалоСтроки", А);
		ГраницыВыделения.Вставить("НачалоКолонки", Б);
		ГраницыВыделения.Вставить("КонецСтроки", В);
		ГраницыВыделения.Вставить("КонецКолонки", КонецКолонки);
		ДописатьГоды(Прошедший, Следующий);
		КорректныйГод = Ложь; 
	КонецЕсли;
	//Элемент.УстановитьГраницыВыделения(А, Б, В, КонецКолонки);	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьГоды(Элемент, Прошедший, Следующий)
 	Годы = СтрРазделить(ЭтаФорма.ПодчиненныеЭлементы.Годы.ТекстРедактирования, "/");
	Прошедший = Число(?(Годы[0] <> Null, Годы[0], 0));
	Следующий = Число(?(Годы[1] <> Null, Годы[1], 0));
КонецФункции	

&НаКлиенте
Функция ДописатьГоды(Прошедший, Следующий)
	//ЭтаФорма.ПодчиненныеЭлементы.Годы = СтрЗаменить(Строка(Прошедший), Символы.НПП, "") + "/" + СтрЗаменить(Строка(Следующий), Символы.НПП, "");
	Объект.Годы = СтрЗаменить(Строка(Прошедший), Символы.НПП, "") + "/" + СтрЗаменить(Строка(Следующий), Символы.НПП, "");
КонецФункции

&НаКлиенте
Функция ИзменёнГод(Элемент)
	Перем НовыйПрошедший, НовыйСледующий;
	ПолучитьГоды(Элемент, НовыйПрошедший, НовыйСледующий);
	Если Прошедший <> НовыйПрошедший Тогда
		Прошедший = НовыйПрошедший;
		Возврат 1;
	КонецЕсли;
	Если Следующий <> НовыйСледующий Тогда
		Следующий = НовыйСледующий;
		Возврат 2;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

&НаКлиенте
Функция ЗаполненГод(Год)
	Год = Число(Год);
	Если Год >=1000 И Год <= 9999 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ГодыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПолучитьГоды(Элемент, Прошедший, Следующий);
	Если ГраницыВыделения <> Неопределено Тогда
		Элемент.УстановитьГраницыВыделения(
			ГраницыВыделения.НачалоСтроки,
			ГраницыВыделения.НачалоКолонки,
			ГраницыВыделения.КонецСтроки,
			ГраницыВыделения.КонецКолонки
		);
		ГраницыВыделения = Неопределено;
	КонецЕсли;
КонецПроцедуры