&НаСервере
Функция ПолучитьЦену(НоменклатураДокумента)
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Контрагент ",Объект.Контрагент);
	СтруктураОтбора.Вставить("Договор",Объект.Договор);
	СтруктураОтбора.Вставить("Номенклатура", НоменклатураДокумента);
            
	РезультатОтбора = РегистрыСведений.ЦеныПоставщиков.Получить(СтруктураОтбора);
            
	Возврат РезультатОтбора.Цена;
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоЦенаПриИзменении(Элемент)
	СтрокаРасчёта = Элементы.Товары.ТекущиеДанные;
	СтрокаРасчёта.Сумма = СтрокаРасчёта.Цена * СтрокаРасчёта.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	СтрокаРасчёта = Элементы.Товары.ТекущиеДанные;
	СтрокаРасчёта.Цена = ПолучитьЦену(СтрокаРасчёта.Товар);
	ТоварыКоличествоЦенаПриИзменении(Элемент)
КонецПроцедуры
