
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ЗакупкаПодарков.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗакупкаПодарков.Дата,
	|	ЗакупкаПодарков.Номер,
	|	ЗакупкаПодарков.НакладнаяНаПодарки.(
	|		Подарки,
	|		ЦенаЗаШтуку,
	|		Количество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ЗакупкаПодарков КАК ЗакупкаПодарков
	|ГДЕ
	|	ЗакупкаПодарков.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНакладнаяНаПодаркиШапка = Макет.ПолучитьОбласть("НакладнаяНаПодаркиШапка");
	ОбластьНакладнаяНаПодарки = Макет.ПолучитьОбласть("НакладнаяНаПодарки");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьНакладнаяНаПодаркиШапка);
		ВыборкаНакладнаяНаПодарки = Выборка.НакладнаяНаПодарки.Выбрать();
		Пока ВыборкаНакладнаяНаПодарки.Следующий() Цикл
			ОбластьНакладнаяНаПодарки.Параметры.Заполнить(ВыборкаНакладнаяНаПодарки);
			ТабДок.Вывести(ОбластьНакладнаяНаПодарки, ВыборкаНакладнаяНаПодарки.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
