
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СведенияОПользователях
	Движения.СведенияОПользователях.Записывать = Истина;
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.СведенияОПользователях.Добавить();
		Движение.Период = Дата;
		Движение.Пользователь = ТекСтрокаСостав.Пользователь;
		Движение.Группа = ГруппаПользователей;
		Движение.Скидка = ТекСтрокаСостав.Скидка;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
